{"Source":"","Type":"Large undead, neutral","HP":{"Value":112,"Notes":"15d8 + 45"},"AC":{"Value":16,"Notes":""},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["50 ft."],"Abilities":{"Str":14,"Dex":18,"Con":16,"Int":12,"Wis":14,"Cha":16},"DamageVulnerabilities":[],"DamageResistances":["none"],"DamageImmunities":["none"],"ConditionImmunities":["Frightened"],"Saves":[{"Name":"DEX","Modifier":7},{"Name":"WIS","Modifier":5},{"Name":"CHA","Modifier":6}],"Skills":[{"Name":"Stealth","Modifier":7},{"Name":"Perception","Modifier":5}],"Senses":["Darkvision 60 ft."],"Languages":["Understands Common and Abyssal but cannot speak"],"Challenge":"5","Traits":[{"Name":"Spectral Presence","Content":"The Black Hound of Dead has an aura of dread. Creatures within 10 feet of it must succeed on a DC 14 Wisdom saving throw or be frightened until the end of their next turn."},{"Name":"Silent Stalker","Content":"The Black Hound has advantage on Dexterity (Stealth) checks when in dim light or darkness."},{"Name":"Spellcasting","Content":"The Black Hound of Dead's spellcasting ability is Charisma (spell save DC 13, +5 to hit with spell attacks). It can innately cast the following spells, requiring no material components: At will: minor illusion, thorn whip; 1/day each: curse of the fallen, shadow blade."}],"Actions":[{"Name":"Multiattack","Content":"The Black Hound of Dead makes three melee attacks: one with its Bite and two with its Claws."},{"Name":"Bite","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage. The target must succeed on a DC 15 Constitution saving throw or take an additional 7 (2d6) necrotic damage at the start of its next turn."},{"Name":"Claw","Content":"Melee Attack: +7 to hit, reach 5 ft., one creature. Hit: 9 (2d4 + 4) slashing damage. If the target is a Medium or smaller creature, it must succeed on a DC 15 Dexterity saving throw or be knocked prone."},{"Name":"Spectral Whirlwind","Content":"The Black Hound summons a whirlwind of spectral energy around it, making a melee attack against each creature within 10 feet. Each target takes 13 (2d8 + 4) force damage, and must succeed on a DC 15 Wisdom saving throw or be frightened until the end of its next turn."},{"Name":"Primary Ranged Attack","Content":"Ranged Attack: +7 to hit, range 20/60 ft., one target. Hit: 13 (2d8 + 4) psychic damage as a chilling howling echoes through the target's mind."},{"Name":"Reaction","Content":"The Black Hound uses a Reaction to add 3 to its AC against one melee attack that would hit it. To do so, the creature must see the attacker, and as it does, a spectral form momentarily appears, startling the assailant."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}