{
	"Source": "",
	"Type": "Medium elemental, unaligned",
	"HP": {
		"Value": 59,
		"Notes": "7d12 + 14"
	},
	"AC": {
		"Value": 13,
		"Notes": "natural armor"
	},
	"InitiativeModifier": 0,
	"InitiativeAdvantage": false,
	"Speed": [
		"0 ft., fly 60 ft. (hover)"
	],
	"Abilities": {
		"Str": 10,
		"Dex": 16,
		"Con": 14,
		"Int": 2,
		"Wis": 10,
		"Cha": 15
	},
	"DamageVulnerabilities": [],
	"DamageResistances": [
		"Lightning, Psychic"
	],
	"DamageImmunities": [
		"Psychic"
	],
	"ConditionImmunities": [
		"Blinded",
		"Frightened"
	],
	"Saves": [
		{
			"Name": "DEX",
			"Modifier": 5
		},
		{
			"Name": "CHA",
			"Modifier": 4
		}
	],
	"Skills": [
		{
			"Name": "Stealth",
			"Modifier": 7
		},
		{
			"Name": "Deception",
			"Modifier": 4
		}
	],
	"Senses": [
		"Blindsight 60 ft."
	],
	"Languages": [
		"Understands Common but can't speak"
	],
	"Challenge": "2",
	"Traits": [
		{
			"Name": "Static Distortion",
			"Content": "Any creature that starts its turn within 10 feet of the Blackout Static must succeed on a DC 14 Constitution saving throw or have its speed halved until the end of its next turn."
		},
		{
			"Name": "Voice Steal",
			"Content": "Creatures within 15 feet of the Blackout Static cannot use verbal components for spells."
		}
	],
	"Actions": [
		{
			"Name": "Static Surge",
			"Content": "Melee Attack: +6 to hit, dealing 14 (3d6 + 4) bludgeoning damage, has a reach of 10 ft., and targets one creature. On a hit, the target must succeed on a DC 14 Constitution saving throw or be stunned until the end of its next turn, as the wave of static disrupts its nervous system."
		},
		{
			"Name": "Disruptive Pulse",
			"Content": "Ranged Attack: +6 to hit, dealing 20 (4d8 + 4) force damage. The Blackout Static emits a pulse of distorted energy that travels up to 120 feet and explodes in a burst of static noise. All creatures within a 10-foot radius of the point of impact must make a DC 14 Dexterity saving throw, taking half damage on a success. On a failure, they also suffer the 'Deafened' condition until the end of their next turn. Recharge 5-6."
		},
		{
			"Name": "Echoing Wail",
			"Content": "The Blackout Static unleashes a haunting distortion of sound. Each creature of its choice within 30 feet must make a DC 14 Wisdom saving throw. On a failed save, a creature takes 18 (4d8) psychic damage and is frightened until the end of its next turn. On a successful save, the creature takes half damage and is not frightened. The Blackout Static’s eerie wails seem to resonate with the deepest fears of its victims. Recharge 6."
		}
	],
	"BonusActions": [],
	"Reactions": [],
	"MythicActions": [],
	"Description": "",
	"Player": "",
	"Version": "3.6.10",
	"ImageURL": ""
}