Blacksite Executive, Scientist
Medium humanoid (human), unaligned
Armor Class 13 (lab coat and personal shielding)
Hit Points 52 (8d8 + 16)
Speed 30 ft.
STR DEX CON INT WIS CHA
10 (+0) 14 (+2) 14 (+2) 18 (+4) 12 (+1) 10 (+0)
Saving Throws INT +5, DEX +4, CON +2
Skills Arcana +7, Investigation +7, Perception +3
Damage Resistances None
Damage Immunities None
Condition Immunities None
Senses Darkvision 60 ft., passive Perception 13
Languages Common, Infernal
Challenge 3 (700 XP)
Research Savant. This scientist has an extensive knowledge of SCP-inspired entities, granting them advantage on Intelligence checks related to anomalous creatures.
Cautious Reflexes. The scientist gains a +2 bonus to initiative rolls and can take the Dodge action as a bonus action on their turn.
Field Analysis. As a reaction when seeing an aberrant creature, the scientist can deduce its weaknesses, providing an ally within 30 feet an additional +1d4 to their next attack roll against that creature.
Actions
Multiattack. The scientist makes two attacks: one with Scientific Probe and one with Anomalous Intuition.
Scientific Probe. Melee Attack: +5 to hit, dealing 6 (1d8 + 2) piercing damage. The target must succeed on a DC 12 Wisdom saving throw or become disoriented, suffering disadvantage on attack rolls until the end of its next turn.
Anomalous Intuition. Melee Attack: +5 to hit, dealing 8 (1d10 + 3) psychic damage. If the target is a creature other than an undead or a construct, it must succeed on a DC 12 Constitution saving throw or experience severe paranoia, losing 5 (1d10) hit points at the start of each of its turns as it questions its own reality. Each time the scientist hits the affected target with this attack, the damage dealt increases by 5 (1d10). Any creature can spend an action to attempt a DC 12 Intelligence check to break free from the condition. The condition also ends if the target receives magical healing.
Neural Disruption. The scientist unleashes a burst of chaotic energy in a 15-foot cone. Each creature in that area must make a DC 12 Constitution saving throw, taking 18 (4d8) psychic damage on a failed save, or half as much damage on a success. This ability recharges on a roll of 5 or 6 on a d6.