{
	"Source": "",
	"Type": "Medium monstrosity, unaligned",
	"HP": {
		"Value": 52,
		"Notes": "8d8 + 16"
	},
	"AC": {
		"Value": 13,
		"Notes": "natural armor"
	},
	"InitiativeModifier": 0,
	"InitiativeAdvantage": false,
	"Speed": [
		"30 ft."
	],
	"Abilities": {
		"Str": 14,
		"Dex": 16,
		"Con": 15,
		"Int": 4,
		"Wis": 12,
		"Cha": 10
	},
	"DamageVulnerabilities": [],
	"DamageResistances": [
		"None"
	],
	"DamageImmunities": [
		"None"
	],
	"ConditionImmunities": [
		"None"
	],
	"Saves": [
		{
			"Name": "DEX",
			"Modifier": 5
		},
		{
			"Name": "WIS",
			"Modifier": 4
		},
		{
			"Name": "CHA",
			"Modifier": 2
		}
	],
	"Skills": [
		{
			"Name": "Deception",
			"Modifier": 4
		},
		{
			"Name": "Stealth",
			"Modifier": 5
		}
	],
	"Senses": [
		"Darkvision 60 ft."
	],
	"Languages": [
		"Undercommon"
	],
	"Challenge": "3",
	"Traits": [
		{
			"Name": "Confusing Appearance",
			"Content": "Any creature that sees the Blemmyeus for the first time must succeed on a DC 13 Wisdom saving throw or be confused for 1 minute. A confused creature can't take reactions and must roll a d10 at the start of each of its turns to determine its behavior."
		},
		{
			"Name": "Headless Vision",
			"Content": "The Blemmyeus can see all around it, ignoring the effects of blinded and invisible conditions, and making it difficult for enemies to surprise it."
		}
	],
	"Actions": [
		{
			"Name": "Multiattack",
			"Content": "The Blemmyeus makes two attacks: one with Confusing Lunge and one with Chest Face Slam."
		},
		{
			"Name": "Confusing Lunge",
			"Content": "Melee Attack: +5 to hit, dealing 6 (1d8 + 2) piercing damage. The target must succeed on a DC 12 Wisdom saving throw or become frightened until the end of its next turn. A frightened creature cannot willingly move closer to the Blemmyeus."
		},
		{
			"Name": "Chest Face Slam",
			"Content": "Melee Attack: +5 to hit, dealing 8 (1d10 + 3) bludgeoning damage. If the target is a creature other than an undead or a construct, it must succeed on a DC 12 Constitution saving throw or be covered in a perplexing illusion, taking 5 (1d10) psychic damage at the start of each of its turns due to disorientation. Each time the Blemmyeus hits the affected target with this attack, the psychic damage dealt increases by 5 (1d10). Any creature can take an action to shake off the illusion with a successful DC 12 check. The condition also ends if the target receives magical healing."
		},
		{
			"Name": "Disorienting Gaze",
			"Content": "The Blemmyeus targets one creature within 30 feet that can see it. The target must succeed on a DC 13 Intelligence saving throw or be charmed for 1 minute. While charmed in this way, the target must use its action to move as close to the Blemmyeus as possible and cannot take reactions. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. This ability can be used once per short or long rest."
		}
	],
	"BonusActions": [],
	"Reactions": [],
	"MythicActions": [],
	"Description": "",
	"Player": "",
	"Version": "3.6.10",
	"ImageURL": ""
}