{"Source":"","Type":"Medium Construct, unaligned","HP":{"Value":52,"Notes":"7d8 + 21"},"AC":{"Value":12,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":12,"Dex":14,"Con":16,"Int":11,"Wis":13,"Cha":15},"DamageVulnerabilities":[],"DamageResistances":["None"],"DamageImmunities":["None"],"ConditionImmunities":["Frightened"],"Saves":[{"Name":"DEX","Modifier":5},{"Name":"CON","Modifier":5},{"Name":"WIS","Modifier":2}],"Skills":[{"Name":"Stealth","Modifier":5},{"Name":"Arcana","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Infernal"],"Challenge":"3","Traits":[{"Name":"Wax Form","Content":"The Candle Walker can move through the shadows, leaving behind a faint scent of burning wax. It does not provoke opportunity attacks when it leaves the reach of an enemy."},{"Name":"Flickering Flame","Content":"The Candle Walker's body burns with a flickering flame that lightly illuminates a 10-foot radius. Creatures within this radius must succeed on a DC 13 Wisdom saving throw or be frightened until the end of their next turn."},{"Name":"Spellcasting","Content":"The Candle Walker is a spellcaster that uses Charisma as its spellcasting ability (spell save DC 12, +4 to hit with spell attacks). It can innately cast the following spells: At will: dancing lights, minor illusion. 1/day each: burning hands, disguise self."}],"Actions":[{"Name":"Multiattack","Content":"The Candle Walker makes three attacks with its main attack."},{"Name":"Flame Whip","Content":"Melee Attack: +6 to hit, dealing 11 (2d8 + 2) fire damage. The target must succeed on a DC 13 Dexterity saving throw or be ignited, taking 2 (1d4) fire damage at the start of each of its turns until a creature uses an action to extinguish the flames."},{"Name":"Wax Projectiles","Content":"Ranged Attack: +6 to hit, dealing 9 (2d6 + 2) bludgeoning damage and the target must succeed on a DC 13 Constitution saving throw or have disadvantage on the next attack roll it makes before the end of its next turn."},{"Name":"Melting Aura","Content":"The Candle Walker emits a wave of hot wax in a 15-foot radius. Each creature in that area must succeed on a DC 13 Strength saving throw or be restrained until the end of its next turn as the wax hardens around them. This ability recharges on a roll of 5 or 6 on a d6."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}