{"Source":"","Type":"Large celestial, neutral good","HP":{"Value":172,"Notes":"15d12 + 75"},"AC":{"Value":18,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 60 ft. (hover)"],"Abilities":{"Str":10,"Dex":14,"Con":20,"Int":16,"Wis":12,"Cha":20},"DamageVulnerabilities":[],"DamageResistances":["Radiant, Psychic, Thunder"],"DamageImmunities":["Poison"],"ConditionImmunities":["Charmed","Frightened"],"Saves":[{"Name":"CON","Modifier":10},{"Name":"CHA","Modifier":10},{"Name":"WIS","Modifier":6},{"Name":"INT","Modifier":6}],"Skills":[{"Name":"Arcana","Modifier":9},{"Name":"Persuasion","Modifier":10},{"Name":"Insight","Modifier":6}],"Senses":["Truesight 60 ft."],"Languages":["Celestial, Common, telepathy 120 ft."],"Challenge":"13","Traits":[{"Name":"Harmonious Resilience","Content":"The Choir can add its proficiency bonus to its saving throws against spells."},{"Name":"Dean of Dissonance","Content":"When the Choir is attacked, it can choose to release a dissonant note as a reaction, giving disadvantage on the attack roll."},{"Name":"Spellcasting","Content":"The Choir's spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). It can innately cast the following spells, requiring no material components: At will: minor illusion, sacred flame, thaumaturgy. 3/day each: healing word, guiding bolt, enhance ability."},{"Name":"Legendary Resistance (3/Day)","Content":"If the Choir fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"The Choir can use its Action to unleash a cacophony of sound. It then makes three attacks: one with Celestial Resonance and two with Harmonic Strike."},{"Name":"Celestial Resonance","Content":"Melee Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) radiant damage. The target must succeed on a DC 18 Wisdom saving throw or be blinded until the end of its next turn."},{"Name":"Harmonic Strike","Content":"Melee Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) thunder damage. The target must succeed on a DC 18 Constitution saving throw or be deafened for 1 minute."},{"Name":"Echoing Dissonance","Content":"Each creature of the Choir's choice that is within 120 feet of it and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to this action for the next 24 hours."},{"Name":"Divine Choir (Recharge 5-6)","Content":"The Choir uses one of the following special abilities: Harmful Resonance or Sleep Melody."},{"Name":"Harmful Resonance","Content":"The Choir creates an effect in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Constitution saving throw, taking 45 (13d6) radiant damage on a failed save, or half as much damage on a successful one."},{"Name":"Sleep Melody","Content":"The Choir releases a soothing melody in a 60-foot cone. Each creature in that area must succeed on a DC 18 Wisdom saving throw or fall asleep for 10 minutes. This effect ends for a creature if the creature takes damage or someone uses an action to wake it."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Detect","Content":"The Choir makes a Wisdom (Perception) check to sense the presence of creatures around it."},{"Name":"Harmonic Strike","Content":"The Choir makes a Harmonic Strike attack."},{"Name":"Resonant Shift (Costs 2 Actions)","Content":"The Choir activates a special ability. Each creature within 10 feet of it must succeed on a DC 19 Constitution saving throw or take 13 (2d6 + 6) thunder damage and be stunned until the end of its next turn. The Choir can then move up to half its flying speed, rearranging itself within the bounds of the celestial soundscape."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}