{"Source":"","Type":"Medium humanoid, unaligned","HP":{"Value":78,"Notes":"12d8 + 24"},"AC":{"Value":11,"Notes":""},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":14,"Con":14,"Int":15,"Wis":12,"Cha":13},"DamageVulnerabilities":[],"DamageResistances":["Psychic"],"DamageImmunities":[],"ConditionImmunities":[""],"Saves":[{"Name":"INT","Modifier":4},{"Name":"WIS","Modifier":3}],"Skills":[{"Name":"Insight","Modifier":3},{"Name":"Arcana","Modifier":4},{"Name":"Stealth","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Common, telepathy 30 ft."],"Challenge":"4","Traits":[{"Name":"Ancient Insight","Content":"The Crouching Elder can read the thoughts of creatures within 30 feet of it. It can choose to gain advantage on Intelligence (Investigation) checks against these creatures."},{"Name":"Cloaking Presence","Content":"The Crouching Elder has advantage on Dexterity (Stealth) checks while crouched, allowing it to blend in seamlessly with its surroundings."},{"Name":"Spellcasting","Content":"The Crouching Elder's spellcasting ability is Intelligence (spell save DC 12, +4 to hit with spell attacks). It can innately cast the following spells: At will: mage hand, minor illusion. 2/day each: disguise self, detect thoughts."}],"Actions":[{"Name":"Thoughtful Strike","Content":"The Crouching Elder makes two psychic strikes. Each attack is a melee spell attack with a +5 to hit, dealing 14 (3d8 + 3) psychic damage. On a hit, the target must succeed on a DC 13 Wisdom saving throw or be incapacitated until the end of their next turn."},{"Name":"Whispering Confusion","Content":"Melee Attack: +5 to hit, dealing 10 (2d6 + 3) psychic damage. If the target is a creature, it must succeed on a DC 12 Intelligence saving throw or become confused until the end of its next turn, acting as if under the effects of the confusion spell."},{"Name":"Soul Drain","Content":"Melee Attack: +5 to hit, dealing 10 (2d6 + 3) necrotic damage. If the target is a creature, it must succeed on a DC 12 Constitution saving throw or take an additional 7 (2d6) necrotic damage. The Crouching Elder regains hit points equal to the necrotic damage dealt."},{"Name":"Phantom's Grasp","Content":"The Crouching Elder conjures ghostly hands that reach for a target within 30 feet. Each creature in a 15-foot radius must succeed on a DC 14 Dexterity saving throw or take 21 (6d6) psychic damage and be restrained until the end of their next turn. This ability recharges on a roll of 5 or 6 on a d6."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}