{"Source":"","Type":"Gargantuan aberration, neutral","HP":{"Value":270,"Notes":"24d12 + 114"},"AC":{"Value":15,"Notes":"evasive shadows"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 60 ft. (hover)"],"Abilities":{"Str":10,"Dex":22,"Con":20,"Int":15,"Wis":14,"Cha":16},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic"],"DamageImmunities":["None"],"ConditionImmunities":["Frightened","Grappled","Paralyzed","Prone","Restrained"],"Saves":[{"Name":"DEX","Modifier":10},{"Name":"CON","Modifier":7},{"Name":"WIS","Modifier":7},{"Name":"CHA","Modifier":6}],"Skills":[{"Name":"Stealth","Modifier":16},{"Name":"Arcana","Modifier":8}],"Senses":["Darkvision 120 ft."],"Languages":["Telepathy 120 ft."],"Challenge":"18","Traits":[{"Name":"Shadowform","Content":"While in dim light or darkness, the Day of the Shadows can become incorporeal, making it immune to all damage from non-magical attacks."},{"Name":"Dreadful Presence","Content":"Creatures that start their turn within 30 feet of the Day of the Shadows must succeed on a DC 18 Wisdom saving throw or be frightened until the end of their next turn."},{"Name":"Legendary Resistance (3/Day)","Content":"If the Day of the Shadows fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"The Day of the Shadows makes two Shadow Claw attacks and one Devouring Darkness attack."},{"Name":"Shadow Claw","Content":"Melee Attack: +15 to hit, dealing 16 (2d10 + 5) slashing damage. On a hit, the target must succeed on a DC 18 Constitution saving throw or have its speed reduced by half until the end of its next turn."},{"Name":"Devouring Darkness","Content":"Melee Attack: +15 to hit, dealing 31 (5d10 + 3) necrotic damage. The creature must make a DC 22 Wisdom saving throw or be blinded until the end of its next turn due to the overwhelming darkness."},{"Name":"Umbral Burst","Content":"Area of effect action (30-foot radius sphere centered on the Day of the Shadows). Each creature within range must make a DC 22 Dexterity saving throw or take 60 (11d10) necrotic damage, or half as much on a successful save. Any creature that fails the save is also enveloped in shadows, imposing disadvantage on its attack rolls until the end of its next turn."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Shadow Shift (Costs 1 Action)","Content":"The Day of the Shadows can shift to a position within 30 feet without provoking opportunity attacks. This action may also free it from grapples or restraints, allowing it to re-position and attack more effectively on its next turn."},{"Name":"Unsettling Whispers (Costs 2 Actions)","Content":"The Day of the Shadows targets one creature within 120 feet, forcing it to make a DC 20 Wisdom saving throw. On a failed save, the creature is incapacitated until the end of its next turn as haunting whispers flood its mind, sapping its will to fight."},{"Name":"Shroud of Despair (Costs 3 Actions)","Content":"The Day of the Shadows conjures a thick cloud of darkness in a 20-foot radius around it. Each creature that starts its turn in this area must make a DC 22 Constitution saving throw. On a failed save, they take 50 (9d10) necrotic damage, and their visions are clouded, giving them disadvantage on saving throws until the end of their next turn."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}