{"Source":"","Type":"Large fiend, chaotic evil","HP":{"Value":200,"Notes":"16d12 + 96"},"AC":{"Value":18,"Notes":"magical clothing"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["40 ft."],"Abilities":{"Str":14,"Dex":17,"Con":22,"Int":12,"Wis":14,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["Fire, Psychic, Thunder"],"DamageImmunities":["Charmed"],"ConditionImmunities":["Frightened","Charmed"],"Saves":[{"Name":"DEX","Modifier":11},{"Name":"CON","Modifier":6},{"Name":"WIS","Modifier":6},{"Name":"CHA","Modifier":11}],"Skills":[{"Name":"Performance","Modifier":10},{"Name":"Stealth","Modifier":11},{"Name":"Insight","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Infernal, Primordial"],"Challenge":"13","Traits":[{"Name":"Dance of Madness","Content":"Creatures that hear the Disco Demon must succeed on a DC 18 Wisdom saving throw or become incapacitated, compelled to dance uncontrollably for 1 minute."},{"Name":"Frenzied Aura","Content":"All creatures within 30 feet of the Disco Demon have disadvantage on saving throws against being charmed or frightened."},{"Name":"Spellcasting","Content":"The Disco Demon's spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). It can innately cast the following spells: At will: dancing lights, minor illusion, vicious mockery; 3/day each: crown of madness, hypnotic pattern, fear; 1/day each: dominate person, confusion."},{"Name":"Legendary Resistance (3/Day)","Content":"If the Disco Demon fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"The Disco Demon can use its Action 4. It then makes three attacks: one with Dazzling Slash and two with Frenzied Strike."},{"Name":"Dazzling Slash","Content":"Melee Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) slashing damage plus 4 (1d8) psychic damage as the blade shimmers with dazzling lights, causing a moment of disorientation and leaving the target charmed until the end of its next turn."},{"Name":"Frenzied Strike","Content":"Melee Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage as the Disco Demon strikes wildly, forcing the target to make a DC 18 Wisdom saving throw or become frightened until the end of its next turn."},{"Name":"Soul-Catching Embrace","Content":"Melee Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) necrotic damage. The target must succeed on a DC 18 Constitution saving throw or be incapacitated until the end of its next turn, as the Demon siphons a fragment of its soul."},{"Name":"Cacophonic Call","Content":"Each creature of the Disco Demon's choice that is within 120 feet of the creature and aware of it must succeed on a DC 14 Wisdom saving throw or be dazzled, suffering disadvantage on attack rolls and ability checks until the end of its next turn, as chaotic beats pulse through their mind."},{"Name":"Rhythmic Wave (Recharge 5–6)","Content":"The Disco Demon releases a torrent of energy in a 60-foot cone. Each creature in that area must make a DC 19 Dexterity saving throw, taking 54 (12d8) thunder damage on a failed save, or half as much damage on a successful one, as the sound wave knocks them off their feet and sends them spinning."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Detect","Content":"The Disco Demon makes a Wisdom (Perception) check, attuning to the emotional vibrations in the room."},{"Name":"Frenzied Strike","Content":"The Disco Demon makes a Frenzied Strike attack, attacking wildly in a manic dance."},{"Name":"Cursed Boogie (Costs 2 Actions)","Content":"The Disco Demon activates a cursed ability. Each creature within 10 feet must succeed on a DC 19 Charisma saving throw or take 13 (2d6 + 6) necrotic damage and be compelled to dance, becoming unable to take reactions until the end of its next turn. The Disco Demon can then move up to half its speed, allowing it to reposition itself for the next round of chaos."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}