{"Source":"","Type":"Large construct, unaligned","HP":{"Value":114,"Notes":"12d10 + 48"},"AC":{"Value":14,"Notes":"armored plating"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":16,"Dex":12,"Con":20,"Int":1,"Wis":10,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["None"],"DamageImmunities":["None"],"ConditionImmunities":["Blinded","Charmed","Deafened","Frightened","Grappled","Incapacitated","Paralyzed","Petrified","Poisoned","Prone","Restrained","Stunned","Unconscious"],"Saves":[{"Name":"CON","Modifier":8}],"Skills":[{"Name":"Perception","Modifier":3}],"Senses":["Blindsight 60 ft."],"Languages":["Understands Common but cannot speak"],"Challenge":"5","Traits":[{"Name":"Tactical Targeting","Content":"The Assault Drone has advantage on attack rolls against creatures that are within 5 feet of it and not behind total cover."},{"Name":"Ramming Maneuver","Content":"When the Assault Drone uses its movement to make a melee attack, it can add its proficiency bonus to the damage dealt."}],"Actions":[{"Name":"Multiattack","Content":"The Assault Drone makes three attacks: one with its Assault Cannon and two with its Ramming Charge."},{"Name":"Assault Cannon","Content":"Ranged Attack: +6 to hit, range 120 ft., one target. Hit: 12 (2d8 + 3) force damage. If the target is a creature, it must succeed on a DC 15 Constitution saving throw or be knocked prone, suffering from a disorienting blast until removed, reducing its attack rolls by 1 until the end of its next turn."},{"Name":"Ramming Charge","Content":"Melee Attack: +6 to hit, reach 10 ft., one target. Hit: 11 (1d8 + 3 + 1d8) bludgeoning damage. If the target is Medium or smaller, it must succeed on a DC 13 Strength saving throw or be pushed 10 feet away and become affected by short-lived circuitry overload, causing it to have disadvantage on the next attack roll."},{"Name":"Overload Burst","Content":"The Assault Drone targets any creature it has damaged with its Ramming Charge. Each creature must succeed on a DC 14 Constitution saving throw or take 10 (2d6 + 3) lightning damage and suffer an overload condition until the end of the creature's next turn, imposing disadvantage on skill checks and attack rolls."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}