{"Source":"","Type":"Medium aberration, unaligned","HP":{"Value":325,"Notes":"27d12 + 150"},"AC":{"Value":18,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 60 ft. (hover)"],"Abilities":{"Str":10,"Dex":14,"Con":20,"Int":16,"Wis":26,"Cha":12},"DamageVulnerabilities":[],"DamageResistances":["Cold, Force, Psychic, Radiant"],"DamageImmunities":["Necrotic, Poison"],"ConditionImmunities":["Blinded","Frightened"],"Saves":[{"Name":"CON","Modifier":12},{"Name":"WIS","Modifier":9},{"Name":"DEX","Modifier":8},{"Name":"INT","Modifier":9}],"Skills":[{"Name":"Arcana","Modifier":9},{"Name":"Insight","Modifier":9},{"Name":"Stealth","Modifier":8}],"Senses":["Darkvision 120 ft.","truesight 60 ft."],"Languages":["Telepathy 120 ft."],"Challenge":"15","Traits":[{"Name":"Hallucination's Embrace","Content":"Ending can create vivid, shared hallucinations in a 60-foot radius. Creatures within that area must succeed on a DC 18 Wisdom saving throw or become incapacitated until the end of their next turn, as they experience visions of their final moments."},{"Name":"Aura of Despair","Content":"Creatures within 10 feet of Ending have disadvantage on saving throws against being frightened and charmed."},{"Name":"Legendary Resistance (3/Day)","Content":"If Ending fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"Ending makes two attacks with Dreadful Touch and one attack with Shattered Reality."},{"Name":"Dreadful Touch","Content":"Melee Attack: +8 to hit, dealing 9 (1d10 + 3) necrotic damage. On a hit, the target must succeed on a DC 18 Constitution saving throw or become poisoned until the end of their next turn as they are overwhelmed by visions of impending doom."},{"Name":"Shattered Reality","Content":"Melee Attack: +8 to hit, dealing 9 (1d10 + 3) psychic damage. The target must succeed on a DC 18 Wisdom saving throw or be frightened until the end of their next turn, experiencing a fleeting glimpse of their own demise."},{"Name":"Hallucinatory Cataclysm","Content":"Area of effect: 30-foot radius centered on Ending. Each creature within range must make a DC 16 Wisdom saving throw or take 33 (7d10) psychic damage, or half as much on a successful save. Creatures who fail the save also have disadvantage on the next attack roll they make as they are haunted by terrifying visions."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Veil of Despair (Costs 1 Action)","Content":"Ending shrouds itself in a veil of darkness, granting it advantage on the next Dexterity saving throw made against an attack. This ability reflects the creature's connection to the fear of death and the unknown."},{"Name":"Shattered Reality (Costs 2 Actions)","Content":"Ending can use the Shattered Reality action."},{"Name":"Time's Lament (Costs 3 Actions)","Content":"Ending targets one creature it can see within 60 feet. The creature must succeed on a DC 18 Intelligence saving throw or take 27 (5d10) psychic damage as memories of their life flash before their eyes and they become incapacitated until the end of their next turn."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}