{"Source":"","Type":"Medium undead, neutral","HP":{"Value":66,"Notes":"12d8 + 12"},"AC":{"Value":15,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 60 ft. (hover)"],"Abilities":{"Str":1,"Dex":18,"Con":14,"Int":10,"Wis":12,"Cha":16},"DamageVulnerabilities":[],"DamageResistances":["Lightning"],"DamageImmunities":["None"],"ConditionImmunities":["Frightened","Grappled","Paralyzed","Petrified","Poisoned","Prone","Restrained","Stunned","Unconscious"],"Saves":[{"Name":"DEX","Modifier":7}],"Skills":[{"Name":"Stealth","Modifier":7}],"Senses":["Darkvision 60 ft."],"Languages":["Understands all languages it knew in life but cannot speak"],"Challenge":"4","Traits":[{"Name":"Incorporeal Movement","Content":"The Energy Wraith can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."},{"Name":"Haunting Presence","Content":"Creatures that start their turn within 30 feet of the Energy Wraith must succeed on a DC 15 Wisdom saving throw or be frightened until the start of their next turn."}],"Actions":[{"Name":"Energy Drain Touch","Content":"Melee Attack: +5 to hit, dealing 6 (1d6 + 3) necrotic damage. On a hit, the target must succeed on a DC 15 Constitution saving throw or have their maximum hit points reduced by an amount equal to the damage taken until they finish a long rest."},{"Name":"Spectral Command","Content":"The Energy Wraith can affect another creature it can see within 30 feet with a compelling aura. The target must succeed on a DC 15 Wisdom saving throw or become charmed for 1 day, obeying the Energy Wraith's verbal or mental commands. If the target takes damage, it can repeat the saving throw, ending the effect on a success."},{"Name":"Wraith's Embrace","Content":"The Energy Wraith can consume the energy of a creature that is affected by Energy Drain Touch or a willing creature. The target must make a DC 15 Constitution saving throw, taking 32 (5d10 + 5) force damage on a failed save, or half as much damage on a successful one. The target's hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the target finishes a long rest."},{"Name":"Ethereal Shroud","Content":"The Energy Wraith can use an action to become incorporeal. While in this ethereal state, it cannot be attacked or affected by spells, but it cannot affect other creatures in return. The Wraith can end this effect as a bonus action."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}