{"Source":"","Type":"Humanoid (shapechanger), neutral","HP":{"Value":90,"Notes":"12d10 + 24"},"AC":{"Value":15,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":12,"Dex":16,"Con":14,"Int":10,"Wis":10,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["None"],"DamageImmunities":["None"],"ConditionImmunities":["None"],"Saves":[{"Name":"DEX","Modifier":6},{"Name":"CHA","Modifier":7}],"Skills":[{"Name":"Deception","Modifier":7},{"Name":"Insight","Modifier":3},{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Common, one other language"],"Challenge":"5","Traits":[{"Name":"Uncanny Mimicry","Content":"False Humans can perfectly mimic the speech and movements of creatures they observe, gaining advantage on Deception checks against creatures that have seen them imitate someone."},{"Name":"Unearthly Presence","Content":"When a False Human comes into view, creatures within 30 feet must succeed on a DC 15 Wisdom saving throw or become charmed by it until the end of their next turn."}],"Actions":[{"Name":"Multiattack","Content":"The False Human makes two attacks: one with its False Embrace and one with its Echoing Strike."},{"Name":"False Embrace","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) psychic damage, plus 3 (1d6) necrotic damage, as the False Human envelops the target in a chilling aura that draws from their very essence."},{"Name":"Echoing Strike","Content":"Melee Attack: +7 to hit, reach 10 ft., one target. Hit: 18 (2d6 + 4 + 2d6) psychic damage, as the False Human mimics the voice of someone the target loves, causing emotional distress. The target must succeed on a DC 14 Wisdom saving throw or become frightened until the end of their next turn."},{"Name":"Distorted Reflection","Content":"The False Human targets one creature it can see within 30 feet. The target must succeed on a DC 15 Charisma saving throw or become incapacitated as they are momentarily lost in a vision of a perfect replica of themselves. If they fail this save, they take 27 (6d8) psychic damage. This ability can be used once per long rest."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}