{"Source":"","Type":"Medium monstrosity, unaligned","HP":{"Value":70,"Notes":"10d10 + 20"},"AC":{"Value":14,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":14,"Dex":18,"Con":14,"Int":2,"Wis":12,"Cha":10},"DamageVulnerabilities":[],"DamageResistances":["Psychic"],"DamageImmunities":[],"ConditionImmunities":["Blinded","Frightened","Poisoned"],"Saves":[{"Name":"DEX","Modifier":7},{"Name":"CON","Modifier":5}],"Skills":[{"Name":"Deception","Modifier":3},{"Name":"Stealth","Modifier":7}],"Senses":["Darkvision 60 ft."],"Languages":["Undercommon"],"Challenge":"6","Traits":[{"Name":"Mimicry","Content":"The Fleshgait can perfectly mimic the appearance of a lost hiker, including their posture and movements, making it difficult to distinguish from actual victims. Any creature that interacts with the Fleshgait must succeed on a DC 15 Wisdom saving throw or be unable to recognize it as a threat."},{"Name":"Evasive Nature","Content":"The Fleshgait gains advantage on Dexterity saving throws against effects that would cause it to be restrained or incapacitated, reflecting its slippery and elusive form."}],"Actions":[{"Name":"Multiattack","Content":"The Fleshgait makes three attacks with its Claw Attack."},{"Name":"Claw Attack","Content":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 18 (2d12 + 5) slashing damage. The target must succeed on a DC 15 Strength saving throw or be knocked prone."},{"Name":"Terrifying Mimicry (Recharge 5-6)","Content":"The Fleshgait unleashes a haunting illusion of a lost hiker's voice. Each creature within a 20-foot radius must make a DC 15 Wisdom saving throw. On a failed save, the target takes 55 (10d10) psychic damage and is frightened until the end of its next turn."},{"Name":"Contorted Lunge","Content":"The Fleshgait distorts its limbs to lunge at a target. Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 22 (3d12 + 4) piercing damage. If the target is a creature, it must succeed on a DC 15 Dexterity saving throw or be grappled (escape DC 15)."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}