{"Source":"","Type":"Medium aberration, neutral","HP":{"Value":114,"Notes":"12d10 + 48"},"AC":{"Value":14,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":16,"Con":18,"Int":12,"Wis":14,"Cha":13},"DamageVulnerabilities":[],"DamageResistances":["Lightning, Force"],"DamageImmunities":["Psychic"],"ConditionImmunities":["Frightened"],"Saves":[{"Name":"DEX","Modifier":6},{"Name":"WIS","Modifier":5}],"Skills":[{"Name":"Arcana","Modifier":4},{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Deep Speech"],"Challenge":"6","Traits":[{"Name":"Ethereal Reflection","Content":"The Glasswalker can move through mirrors and reflective surfaces as if they were difficult terrain. When it does so, it can appear in any unoccupied space adjacent to a reflective surface."},{"Name":"Mirror Image","Content":"When a Glasswalker is targeted by an attack, it can use its reaction to create illusory duplicates of itself, granting disadvantage on the attack roll against it until the start of its next turn."},{"Name":"Spellcasting","Content":"The Glasswalker is a 7th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 13, +5 to hit with spell attacks). It has the following spells prepared: At will: minor illusion, mage hand, fog cloud. 3/day each: mirror image, misty step, mirror of life trapping."}],"Actions":[{"Name":"Multiattack","Content":"The Glasswalker makes three attacks: one with Shattered Strike, one with Reflection Thrust, and one with Mirror Slash. When its Ethereal Reflection ability is available, it can use the ability in place of Shattered Strike."},{"Name":"Shattered Strike","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) psychic damage. The target must succeed on a DC 15 Wisdom saving throw or become frightened until the end of its next turn as the Glasswalker's chaotic energy shatters its mental defenses."},{"Name":"Reflection Thrust","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (1d12 + 4) force damage. On a hit, the target's movement speed is reduced by half until the end of its next turn as the force of the strike distorts their path."},{"Name":"Mirror Slash","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage. If the target is hit, the Glasswalker can attempt to push the target 5 feet back as its form reflects their own vulnerabilities."},{"Name":"Mirror Cascade (Recharge 5-6)","Content":"The Glasswalker creates a dazzling burst of light in a 15-foot cone from its reflective body. Each creature in that area must make a DC 15 Dexterity saving throw, taking 31 (7d8) radiant damage on a failed save, or half as much damage on a successful one as they are momentarily blinded by the light of the mirrors."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}