{"Source":"","Type":"Large construct, unaligned","HP":{"Value":87,"Notes":"9d10 + 18"},"AC":{"Value":12,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":18,"Dex":10,"Con":15,"Int":1,"Wis":1,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["Poison"],"DamageImmunities":["None"],"ConditionImmunities":["Poisoned"],"Saves":[{"Name":"STR","Modifier":7},{"Name":"CON","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":3}],"Senses":["Blindsight 60 ft."],"Languages":["Understand the languages of its creator but cannot speak"],"Challenge":"5","Traits":[{"Name":"Sewage Trail","Content":"The Waste Golem leaves a trail of toxic waste in its wake. Any creature that starts its turn in this trail must make a DC 15 Constitution saving throw or be poisoned until the end of its next turn."},{"Name":"Shapeless Form","Content":"The Waste Golem can squeeze through tight spaces as if it were one size smaller."},{"Name":"Legendary Resistance (3/Day)","Content":"If the creature fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"The Waste Golem makes two attacks: one with its Slam and one with its Contaminated Slam."},{"Name":"Slam","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage."},{"Name":"Contaminated Slam","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage. If the target is a creature and is already poisoned, it takes an additional 9 (2d8) necrotic damage and must make a DC 15 Constitution saving throw or become blinded until the end of its next turn."},{"Name":"Toxic Surge","Content":"The Waste Golem releases a wave of toxic waste in a 15-foot radius. Each creature in that area must make a DC 15 Constitution saving throw, taking 22 (4d10) poison damage on a failed save, or half as much damage on a successful one. The area becomes difficult terrain until the end of the golem's next turn."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Primary Attack","Content":"The Waste Golem makes one attack with its Slam."},{"Name":"Toxic Shield (Costs 2 Actions)","Content":"The Waste Golem surrounds itself with a mist of corrosive waste. All creatures within 5 feet of it must make a DC 15 Dexterity saving throw, taking 14 (4d6) acid damage on a failed save, or half as much on a success."},{"Name":"Regenerate (Costs 3 Actions)","Content":"The Waste Golem regains 11 (2d8 + 2) hit points as it absorbs waste from the environment."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}