{"Source":"","Type":"Medium aberration, neutral","HP":{"Value":110,"Notes":"13d10 + 39"},"AC":{"Value":19,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":16,"Con":16,"Int":14,"Wis":12,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic, Thunder"],"DamageImmunities":["Fear, Madness"],"ConditionImmunities":["Frightened","Charmed"],"Saves":[{"Name":"DEX","Modifier":5},{"Name":"CON","Modifier":5},{"Name":"WIS","Modifier":2},{"Name":"CHA","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":8},{"Name":"Insight","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Telepathy 60 ft."],"Challenge":"6","Traits":[{"Name":"Presence of Dread","Content":"Enemies that start their turn within 30 feet of the Hat Man must succeed on a DC 14 Wisdom saving throw or be frightened until the end of their next turn."},{"Name":"Shadowy Resilience","Content":"The Hat Man has advantage on saving throws against being incapacitated and is immune to the poisoned condition."},{"Name":"Spellcasting","Content":"The Hat Man is a 9th-level spellcaster. His spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). He can innately cast the following spells: At will: minor illusion, thaumaturgy; 3/day each: fear, suggestion; 1/day each: confusion, dominate person."}],"Actions":[{"Name":"Multiattack","Content":"The Hat Man makes three attacks: one with Dark Embrace and two with Nightmares."},{"Name":"Dark Embrace","Content":"Melee Spell Attack: +7 to hit, reach 10 ft., one target. Hit: 15 (2d10 + 4) psychic damage. The target must succeed on a DC 14 Wisdom saving throw or become frightened until the end of their next turn."},{"Name":"Nightmares","Content":"Melee Spell Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) psychic damage. The target must make a DC 14 Wisdom saving throw or be incapacitated until the end of their next turn as they are overwhelmed by fear and horror."},{"Name":"Horrifying Visage (Recharge 5-6)","Content":"The Hat Man presents an unsettling appearance in a 40-foot line that is 5 feet wide. Each creature in that line must make a DC 14 Wisdom saving throw, taking 42 (12d6) psychic damage on a failed save, or half as much on a successful one. Creatures that fail the save are also frightened until the end of their next turn."},{"Name":"Soporific Mist (Recharge 5-6)","Content":"The Hat Man releases a thick mist in a 30-foot cone. Each creature in that area must succeed on a DC 14 Constitution saving throw or fall unconscious for 1 minute. The effect ends for a creature if it takes damage or someone uses an action to wake it."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}