{"Source":"","Type":"Medium monstrosity, neutral","HP":{"Value":45,"Notes":"10d8"},"AC":{"Value":11,"Notes":""},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["40 ft."],"Abilities":{"Str":12,"Dex":16,"Con":14,"Int":1,"Wis":10,"Cha":5},"DamageVulnerabilities":[],"DamageResistances":["None"],"DamageImmunities":["None"],"ConditionImmunities":["None"],"Saves":[{"Name":"DEX","Modifier":4},{"Name":"CON","Modifier":3}],"Skills":[{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Understands Common but can't speak"],"Challenge":"4","Traits":[{"Name":"Evasive Movement","Content":"The Hippanthrope can move through the space of any creature that is Medium or larger, and makes it difficult to track its movement."},{"Name":"Haunting Presence","Content":"Creatures within 30 feet of the Hippanthrope must succeed on a DC 12 Wisdom saving throw or become frightened until the end of their next turn."}],"Actions":[{"Name":"Necrotic Kick","Content":"Melee Attack: +5 to hit, dealing 17 (4d6 + 3) necrotic damage. The Hippanthrope delivers a powerful kick with its horse-like legs, leaving a chilling energy that saps life from its target."},{"Name":"Ethereal Stride","Content":"The Hippanthrope can phase between the material plane and the ethereal plane, becoming incorporeal for 1 minute. While in this state, it cannot interact physically with others, and others cannot interact with it unless they have special abilities that allow for such interactions. It can end this effect as a bonus action."},{"Name":"Terrifying Gaze","Content":"Any creature within 30 feet of the Hippanthrope that can see it must succeed on a DC 13 Wisdom saving throw or become frightened for 1 minute. An affected creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."},{"Name":"Phantom Control","Content":"The Hippanthrope can exert control over a creature it can see within 30 feet. The target must succeed on a DC 13 Wisdom saving throw or become incapacitated for up to 1 minute. The affected creature retains awareness but cannot control its body. The target can repeat the saving throw at the end of each of its turns, ending the effect on a success. The target is immune to this ability for 24 hours after succeeding on its saving throw."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}