{"Source":"","Type":"Medium undead, neutral","HP":{"Value":52,"Notes":"8d8 + 16"},"AC":{"Value":17,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":14,"Con":14,"Int":1,"Wis":10,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["Necrotic"],"DamageImmunities":[],"ConditionImmunities":["Charmed","Frightened","Incapacitated"],"Saves":[{"Name":"DEX","Modifier":4},{"Name":"CON","Modifier":2},{"Name":"WIS","Modifier":2},{"Name":"CHA","Modifier":4}],"Skills":[{"Name":"Stealth","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Understands Common but can't speak"],"Challenge":"3","Traits":[{"Name":"Eerie Presence","Content":"Hollows emanate a sense of unease. Creatures within 10 feet of a Hollow have disadvantage on Wisdom saving throws against being frightened."},{"Name":"Unyielding Form","Content":"As an undead, Hollows cannot die in the traditional sense. When reduced to 0 hit points, they automatically stabilize and remain unconscious, unable to be revived until they are healed."}],"Actions":[{"Name":"Soul Siphon","Content":"Melee Attack: +5 to hit, dealing 8 (1d10 + 3) necrotic damage plus 3 (1d6) psychic damage. The target must succeed on a DC 12 Wisdom saving throw or have disadvantage on its next attack roll."},{"Name":"Deathly Whispers (Recharge 5-6)","Content":"The Hollow emits a haunting whisper that chills the soul. Each creature in a 30-foot line that is 5 feet wide must make a DC 12 Wisdom saving throw, taking 22 (4d10) psychic damage on a failed save, or half as much damage on a successful one. On a failed save, creatures are also frightened until the end of their next turn."},{"Name":"Grasp of the Past","Content":"Hollows extend their bony hands to grasp at the memories of their victim. Ranged Attack: +5 to hit, dealing 15 (2d12 + 3) necrotic damage. The target must make a DC 12 Intelligence saving throw. On a failed save, they cannot take reactions until the end of their next turn, as they are momentarily paralyzed by memories of their past."},{"Name":"Dreamless Slumber","Content":"The Hollow taps into the sleep of a creature nearby, attempting to pull them into a dreamless state. The target must make a DC 12 Constitution saving throw or be put into a magical slumber for 1 minute. The creature can repeat the saving throw at the end of each of its turns, waking on a success. While asleep, the creature is unconscious."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}