{"Source":"","Type":"Medium undead, neutral","HP":{"Value":90,"Notes":"12d10 + 24"},"AC":{"Value":15,"Notes":"mage armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":14,"Con":14,"Int":16,"Wis":12,"Cha":20},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic"],"DamageImmunities":["Poison"],"ConditionImmunities":["Charmed","Frightened"],"Saves":[{"Name":"WIS","Modifier":4},{"Name":"CHA","Modifier":8}],"Skills":[{"Name":"Deception","Modifier":8},{"Name":"Performance","Modifier":8},{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Common, one additional language of choice"],"Challenge":"5","Traits":[{"Name":"Celebrity Presence","Content":"The Hollowed Celebrity exudes an aura of influence. Creatures within 30 feet of it have disadvantage on saving throws against being charmed."},{"Name":"Aura of Glamour","Content":"All friendly creatures within 10 feet of the Hollowed Celebrity gain a +1 bonus to attack rolls and saving throws."},{"Name":"Spellcasting","Content":"The Hollowed Celebrity is a 10th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 15, +8 to hit with spell attacks). It can innately cast the following spells, requiring no material components: At will: dancing lights, minor illusion, mage hand; 3/day each: charm person, disguise self, invisibility; 1/day each: fear, greater invisibility."}],"Actions":[{"Name":"Multiattack","Content":"The Hollowed Celebrity can make two attacks with its charismatic presence and haunting allure."},{"Name":"Charismatic Smite","Content":"Melee Attack: +8 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) psychic damage as the Hollowed Celebrity's intense gaze drains the target's hope."},{"Name":"Phantasmal Influence (Recharge 4-6)","Content":"Each creature in the Hollowed Celebrity's space must make a DC 13 Wisdom saving throw. On a failure, a target takes 15 (3d8 + 2) psychic damage and is frightened until the end of its next turn. If the target is charmed, it instead takes an additional 7 (2d6) psychic damage. If another creature in the radius is charmed, it must also succeed on a DC 13 Wisdom saving throw or take the same damage and suffer the frightened condition. On a successful save, the target takes half the damage and is not frightened."},{"Name":"Reverberating Fame (Recharge 5-6)","Content":"The Hollowed Celebrity reverberates with echoes of its past fame. Each creature within 30 feet must make a DC 13 Charisma saving throw. On a failure, the target takes 21 (6d6) psychic damage and is stunned until the end of its next turn. If the creature has seen the Hollowed Celebrity before, it has disadvantage on this saving throw. On a success, the target takes half damage and is not stunned."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}