{"Source":"","Type":"Tiny construct, unaligned","HP":{"Value":22,"Notes":"5d8"},"AC":{"Value":12,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 30 ft. (hover)"],"Abilities":{"Str":1,"Dex":16,"Con":10,"Int":10,"Wis":12,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["None"],"DamageImmunities":["None"],"ConditionImmunities":["Unconscious"],"Saves":[{"Name":"DEX","Modifier":5},{"Name":"WIS","Modifier":3}],"Skills":[{"Name":"Stealth","Modifier":5}],"Senses":["Blindsight 60 ft."],"Languages":["Understand Common and can communicate telepathically within 60 ft."],"Challenge":"1","Traits":[{"Name":"Memory Erasure","Content":"Any creature that ends its turn within 10 feet of the Hollow File must succeed on a DC 11 Wisdom saving throw or have its memories of the past 24 hours erased."},{"Name":"Ephemeral Presence","Content":"The Hollow File can move through objects and creatures as if they were difficult terrain. It takes 1d10 force damage if it ends its turn inside an object."}],"Actions":[{"Name":"Memory Drain","Content":"Melee Attack: +4 to hit, dealing 10 (3d6) psychic damage. The target must succeed on a DC 10 Wisdom saving throw or have disadvantage on Intelligence saving throws until it completes a short or long rest. This attack embodies the essence of a memory erasure, disrupting the target’s mental processes."},{"Name":"Erase Identity","Content":"Melee Attack: +4 to hit, dealing 10 (3d6) force damage. The target must succeed on a DC 10 Constitution saving throw or have their name changed to a random noun until the end of the Hollow File's next turn. This action symbolizes the erasure of one’s identity, leaving them disoriented and confused."},{"Name":"Temporal Veil","Content":"Melee Attack: +4 to hit, dealing 10 (3d6 necrotic damage. The target must succeed on a DC 10 Dexterity saving throw or become blinded until the end of their next turn. This attack represents the Hollow File's ability to obscure the target's perception of time and reality, enveloping them in a shroud of lost memories."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}