{"Source":"","Type":"Medium undead, neutral","HP":{"Value":165,"Notes":"20d10 + 65"},"AC":{"Value":16,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":14,"Con":16,"Int":14,"Wis":12,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic, Force"],"DamageImmunities":["Poison, Psychic"],"ConditionImmunities":["Frightened","Charmed"],"Saves":[{"Name":"CON","Modifier":7},{"Name":"CHA","Modifier":5},{"Name":"WIS","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":6},{"Name":"Arcana","Modifier":5}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Infernal"],"Challenge":"8","Traits":[{"Name":"Dreadful Presence","Content":"Creatures that start their turn within 30 feet of the Hollow Eyed Woman and can see her must succeed on a DC 15 Wisdom saving throw or be frightened until the end of their next turn."},{"Name":"Memory Drain","Content":"Whenever a creature is frightened by the Hollow Eyed Woman, it must succeed on a DC 15 Intelligence saving throw or lose the ability to recall its last memory. This effect lasts until the creature finishes a short or long rest."},{"Name":"Spellcasting","Content":"The Hollow Eyed Woman's spellcasting ability is Charisma (spell save DC 16, +8 to hit with spell attacks). She can innately cast the following spells: At will: chill touch, minor illusion. 3/day each: fear, phantasmal force, detect thoughts."}],"Actions":[{"Name":"Multiattack","Content":"The Hollow Eyed Woman makes two Spectral Touch attacks."},{"Name":"Spectral Touch","Content":"Melee Spell Attack: +8 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 6) necrotic damage, and the target must succeed on a DC 15 Constitution saving throw or have disadvantage on the next attack roll it makes before the end of its next turn."},{"Name":"Terrifying Visage (Recharge 5-6)","Content":"The Hollow Eyed Woman radiates an aura of dread in a 30-foot radius centered on herself. Each creature in that area must make a DC 14 Wisdom saving throw, taking 42 (10d8) psychic damage on a failed save, or half as much damage on a successful one. Additionally, on a failed save, creatures are frightened until the end of their next turn."},{"Name":"Rejuvenating Gaze","Content":"When a creature within 30 feet makes a successful saving throw against being frightened, the Hollow Eyed Woman can use her reaction to regain 15 hit points."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}