{"Source":"","Type":"Medium construct, unaligned","HP":{"Value":65,"Notes":"10d8 + 20"},"AC":{"Value":15,"Notes":"magic resistance"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 30 ft. (hover)"],"Abilities":{"Str":10,"Dex":16,"Con":14,"Int":1,"Wis":10,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["Psychic"],"DamageImmunities":["None"],"ConditionImmunities":["Blinded","Charmed","Frightened","Grappled","Incapacitated","Paralyzed","Petrified","Poisoned","Prone","Restrained","Stunned","Unconscious"],"Saves":[{"Name":"DEX","Modifier":3},{"Name":"CON","Modifier":3},{"Name":"WIS","Modifier":3},{"Name":"CHA","Modifier":3}],"Skills":[{"Name":"Stealth","Modifier":5}],"Senses":["Blindsight 60 ft."],"Languages":["Understands all languages it knew in life but cannot speak"],"Challenge":"3","Traits":[{"Name":"Memory Fog","Content":"Any creature that starts its turn within 5 feet of the Hollow File must succeed on a DC 12 Wisdom saving throw or loses all short-term memory for 1 minute, forgetting the name and purpose of objects and creatures it is interacting with."},{"Name":"Evasive Presence","Content":"The swarm's near-transparent form grants it advantage on Dexterity saving throws against attacks or effects that rely on sight."}],"Actions":[{"Name":"Multiattack","Content":"The Hollow File makes two attacks: one with its Memory Shred and one with its Obfuscate Strike."},{"Name":"Memory Shred","Content":"Melee Attack: +5 to hit, dealing 7 (1d8 + 3) psychic damage. On a hit, the target must succeed on a DC 12 Wisdom saving throw or take an additional 3 (1d6) psychic damage and suffer disadvantage on Intelligence checks until the end of its next turn."},{"Name":"Obfuscate Strike","Content":"Ranged Attack: +5 to hit, dealing 7 (1d8 + 3) force damage. On a hit, the target’s memory is briefly obscured. The target must succeed on a DC 12 Wisdom saving throw or be confused until the end of its next turn, treating allies as enemies."},{"Name":"File Obliteration","Content":"The Hollow File releases a wave of memory-erasing energy in a 15-foot cone. Each creature in that area must make a DC 12 Wisdom saving throw, taking 30 (4d12 + 4) psychic damage on a failed save, or half as much damage on a successful one. This action can be used once and recharges after a short or long rest. A creature that fails the save has its memories of the last hour erased."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}