{"Source":"","Type":"Large undead, neutral","HP":{"Value":136,"Notes":"16d10 + 48"},"AC":{"Value":15,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["60 ft."],"Abilities":{"Str":18,"Dex":16,"Con":16,"Int":1,"Wis":12,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic"],"DamageImmunities":["Poison"],"ConditionImmunities":["Frightened","Poisoned"],"Saves":[{"Name":"STR","Modifier":7},{"Name":"DEX","Modifier":6},{"Name":"CON","Modifier":6}],"Skills":[{"Name":"Perception","Modifier":4},{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Understands Common but can't speak"],"Challenge":"5","Traits":[{"Name":"Silent Watch","Content":"The Moddey Dhoo is always aware of its surroundings and can sense creatures within 30 feet, even if they are invisible or hidden."},{"Name":"Cursed Gaze","Content":"Any creature that starts its turn within 30 feet of the Moddey Dhoo and can see its eyes must succeed on a DC 15 Wisdom saving throw or be cursed. A cursed creature takes 3d6 necrotic damage at the start of each of its turns. The curse lasts until removed by a greater restoration spell or similar magic."}],"Actions":[{"Name":"Multiattack","Content":"The Hound of Dead, Moddey Dhoo makes two primary attacks. If both attacks hit a Medium or smaller target, the target suffers the Frightened condition (escape DC 14), and the Hound uses its Cursed Gaze ability on it."},{"Name":"Primary Attack","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) necrotic damage. The jaws of the Moddey Dhoo tear into the flesh of its prey, leaving a lingering curse upon those who succumb to its bite."},{"Name":"Cursed Gaze","Content":"The Moddey Dhoo locks eyes with a creature within 30 feet. The target must succeed on a DC 15 Wisdom saving throw or be cursed. A cursed creature takes 13 (2d8 + 4) necrotic damage at the start of each of its turns. The curse lasts until removed by a greater restoration spell or similar magic."},{"Name":"Shadow of Death","Content":"The Moddey Dhoo shrouds a target in a wave of invisible terror. One creature within 30 feet must succeed on a DC 14 Wisdom saving throw or become paralyzed until the end of its next turn. On a failed save, it also takes 13 (2d8 + 4) necrotic damage as it feels the weight of impending doom. This ability recharges after a short or long rest."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}