{"Source":"","Type":"Medium undead, neutral","HP":{"Value":85,"Notes":"10d10 + 30"},"AC":{"Value":12,"Notes":""},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["50 ft."],"Abilities":{"Str":14,"Dex":16,"Con":16,"Int":1,"Wis":12,"Cha":6},"DamageVulnerabilities":[],"DamageResistances":["None"],"DamageImmunities":["None"],"ConditionImmunities":["Frightened","Poisoned"],"Saves":[{"Name":"DEX","Modifier":4},{"Name":"CON","Modifier":3}],"Skills":[{"Name":"Perception","Modifier":3},{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Understand the languages of the living but cannot speak"],"Challenge":"4","Traits":[{"Name":"Ethereal Howl","Content":"The Hound's howls resonate in the minds of those nearby, causing them to feel an unsettling sense of dread, imposing disadvantage on saving throws against being frightened."},{"Name":"Soul Guide","Content":"When the Hound of Dead drops a creature to 0 hit points, it can choose to guide the soul instead of killing it, allowing the creature to make a Wisdom saving throw to avoid death, returning with 1 hit point unless it fails the save."}],"Actions":[{"Name":"Multiattack","Content":"The Hound of Dead makes two attacks: one with Claw Strike and one with Soul Rend."},{"Name":"Claw Strike","Content":"Melee Attack: +7 to hit, dealing 14 (2d8 + 5) slashing damage. A creature hit by this attack must succeed on a DC 14 Strength saving throw or be knocked prone."},{"Name":"Soul Rend","Content":"Melee Attack: +7 to hit, dealing 14 (2d8 + 5) necrotic damage. On a hit, the target must succeed on a DC 14 Constitution saving throw or their hit point maximum is reduced by an amount equal to the necrotic damage dealt until they finish a long rest."},{"Name":"Howl of the Hunt","Content":"The Hound emits a haunting howl that chills the souls of mortals nearby. Each creature of the Hound's choice within 30 feet must make a DC 14 Wisdom saving throw or be frightened until the end of their next turn. On a successful save, they take 21 (6d6) psychic damage. The Hound can use this ability once per short rest."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}