{"Source":"","Type":"Large fey, neutral","HP":{"Value":78,"Notes":"12d8 + 24"},"AC":{"Value":11,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["50 ft."],"Abilities":{"Str":14,"Dex":16,"Con":14,"Int":12,"Wis":18,"Cha":11},"DamageVulnerabilities":[],"DamageResistances":["Psychic"],"DamageImmunities":["none"],"ConditionImmunities":["none"],"Saves":[{"Name":"DEX","Modifier":5},{"Name":"WIS","Modifier":6}],"Skills":[{"Name":"Perception","Modifier":6},{"Name":"Stealth","Modifier":5}],"Senses":["Blindsight 60 ft."],"Languages":["Primordial, Sylvan"],"Challenge":"4","Traits":[{"Name":"Misty Presence","Content":"While in misty or foggy terrain, Kotojelen has advantage on Dexterity (Stealth) checks and attack rolls against creatures that cannot see it."},{"Name":"Watcher of Memories","Content":"Kotojelen can sense the memories and emotions of creatures within 30 feet. It gains advantage on Insight checks against these creatures."},{"Name":"Spellcasting","Content":"Kotojelen's spellcasting ability is Wisdom (spell save DC 14, +6 to hit with spell attacks). It can innately cast the following spells: At will: minor illusion, entangle. 1/day each: fog cloud, sleep, misty step."}],"Actions":[{"Name":"Memory's Embrace","Content":"Kotojelen makes two attacks with its misty antlers. It unleashes a radiant mist with its first attack, dealing 10 (2d6 + 3) psychic damage. The target must succeed on a DC 13 Wisdom saving throw or be unable to recall any memories of the last hour, effectively making it confused until the start of its next turn. The second attack deals 10 (2d6 + 3) damage as Kotojelen strikes with its antlers."},{"Name":"Ethereal Strike","Content":"Melee Attack: +5 to hit, dealing 10 (2d6 + 3) force damage. If the target is a creature, it must succeed on a DC 12 Constitution saving throw or be pushed back 10 feet and knocked prone as ethereal tendrils entwine around them."},{"Name":"Spectral Fog","Content":"Kotojelen releases a swirling cloud of fog in a 15-foot radius around it. Any creature that starts its turn in the fog takes 30 (4d12 + 4) psychic damage. Anyone who enters the area must succeed on a DC 14 Wisdom saving throw or become frightened until the end of its next turn. This action recharges on a roll of 5 or 6 on a d6."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}