{"Source":"","Type":"Medium aberration, neutral","HP":{"Value":58,"Notes":"9d8 + 18"},"AC":{"Value":11,"Notes":""},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":14,"Con":14,"Int":12,"Wis":16,"Cha":16},"DamageVulnerabilities":[],"DamageResistances":["Psychic, Necrotic"],"DamageImmunities":["Poison"],"ConditionImmunities":["Frightened"],"Saves":[{"Name":"WIS","Modifier":5}],"Skills":[{"Name":"Deception","Modifier":5},{"Name":"Insight","Modifier":5},{"Name":"Stealth","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Common, telepathy 60 ft."],"Challenge":"3","Traits":[{"Name":"Ethereal Presence","Content":"Loab can move through reflections and shadows, allowing her to appear and disappear from sight. She can use her Dexterity (Stealth) modifier to hide even when lightly obscured."},{"Name":"Feed on Sorrow","Content":"When a creature within 30 feet of Loab experiences grief or emotional pain, she can sense it. This grants her advantage on Insight checks against that creature, and she can manipulate that creature's emotions as if under the effects of the spell 'Charm Person'."}],"Actions":[{"Name":"Multiattack","Content":"Loab can use Action 2 and makes one attack with Grasp of Regret."},{"Name":"Grasp of Regret","Content":"Melee Attack: +5 to hit, dealing 20 (5d6 + 3) psychic damage. The target must succeed on a DC 12 Wisdom saving throw or suffer a condition that prevents it from regaining hit points and reduces its hit point maximum by 10 (3d6) for every 24 hours that elapse until the effect is removed."},{"Name":"Haunting Glare","Content":"Loab targets one enemy it can see within 60 feet. If the target can see her, it must succeed on a DC 11 Wisdom saving throw or be frightened until the end of its next turn. If the target fails the saving throw by 5 or more, it is paralyzed until the end of its next turn instead. A target that succeeds on the saving throw is immune to Haunting Glare for the next 24 hours."},{"Name":"Echoes of Despair","Content":"Loab channels her sorrowful essence into a wave of haunting memories. Each creature of her choice within a 15-foot cone must make a DC 13 Constitution saving throw, taking 30 (4d12 + 4) necrotic damage on a failed save, or half as much damage on a successful one. After using this ability, Loab must finish a short or long rest to use it again."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}