{
	"Source": "",
	"Type": "Medium Aberration (Virus), chaotic",
	"HP": {
		"Value": 70,
		"Notes": "10d10 + 20"
	},
	"AC": {
		"Value": 14,
		"Notes": "variable"
	},
	"InitiativeModifier": 0,
	"InitiativeAdvantage": false,
	"Speed": [
		"30 ft."
	],
	"Abilities": {
		"Str": 10,
		"Dex": 16,
		"Con": 15,
		"Int": 1,
		"Wis": 6,
		"Cha": 1
	},
	"DamageVulnerabilities": [],
	"DamageResistances": [
		"Necrotic"
	],
	"DamageImmunities": [
		"None"
	],
	"ConditionImmunities": [
		"Poisoned",
		"Charmed",
		"Frightened"
	],
	"Saves": [
		{
			"Name": "DEX",
			"Modifier": 6
		},
		{
			"Name": "CON",
			"Modifier": 5
		}
	],
	"Skills": [
		{
			"Name": "Stealth",
			"Modifier": 6
		}
	],
	"Senses": [
		"Blindsight 60 ft."
	],
	"Languages": [
		"Understands Deep Speech but cannot speak"
	],
	"Challenge": "6",
	"Traits": [
		{
			"Name": "Viral Load",
			"Content": "When a creature is hit by the virus's natural attack or starts its turn in the Macro-virus's Aerosol Aura (10 ft., DC 12-15), it must make a Constitution saving throw. On a failed save, it gains 1 Viral Load (maximum of 3 or 4 based on tier). Each stack imposes a -1 penalty to attack rolls and checks, and at 3 or more stacks, the target is poisoned and cannot regain hit points until the end of its next turn. A successful save removes 1 stack at the end of the creature's turn."
		},
		{
			"Name": "Fractal Split",
			"Content": "When the Macro-virus is reduced to 60 hit points or fewer, it splits into two Polyhedral Shards, each with an armor class of 14 and hit points of 45. The shards have identical actions as the Macro-virus but cannot split further."
		}
	],
	"Actions": [
		{
			"Name": "Multiattack",
			"Content": "The Macro-virus makes three attacks with Viral Emission."
		},
		{
			"Name": "Viral Emission",
			"Content": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 18 (2d12 + 5) necrotic damage. The target must succeed on a DC 12 Constitution saving throw or gain 1 Viral Load."
		},
		{
			"Name": "Contamination Tiles",
			"Content": "The Macro-virus seeds two 10-foot squares within 60 feet, each becoming slick biofilm. Creatures that start their turn in these squares must make a DC 15 Constitution saving throw. On a failed save, they gain 1 Viral Load and take 7 (1d6 + 1) necrotic damage. The area is considered difficult terrain for enemies."
		},
		{
			"Name": "Bacterial Wave (Recharge 5-6)",
			"Content": "The Macro-virus releases a wave of viral energy in a 20-foot radius centered on itself. Each creature in that area must make a DC 15 saving throw, taking 55 (10d10) necrotic damage on a failed save, or half as much damage on a successful one. In addition, affected targets gain 1 Viral Load."
		}
	],
	"BonusActions": [],
	"Reactions": [],
	"MythicActions": [],
	"Description": "",
	"Player": "",
	"Version": "3.6.10",
	"ImageURL": ""
}