{"Source":"","Type":"Huge construct, unaligned","HP":{"Value":270,"Notes":"24d12 + 114"},"AC":{"Value":15,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["40 ft."],"Abilities":{"Str":24,"Dex":10,"Con":26,"Int":1,"Wis":12,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["Bludgeoning, Slashing"],"DamageImmunities":["None"],"ConditionImmunities":["Prone","Grappled","Restrained"],"Saves":[{"Name":"STR","Modifier":13},{"Name":"CON","Modifier":14},{"Name":"WIS","Modifier":7},{"Name":"DEX","Modifier":6}],"Skills":[{"Name":"Perception","Modifier":7},{"Name":"Intimidation","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Understands Common but cannot speak"],"Challenge":"18","Traits":[{"Name":"Congested Mass","Content":"The Living Traffic Jam absorbs anything within its path. Creatures and objects of Medium size or smaller that are caught in its movement are engulfed and take 3d10 bludgeoning damage at the start of each of their turns while trapped."},{"Name":"Urban Anomaly","Content":"The Living Traffic Jam appears in urban areas where traffic is dense. It gains advantage on checks to avoid being restrained or impeded in areas with difficult terrain related to vehicles or construction."},{"Name":"Crushing Inevitability","Content":"Once it starts moving, the Living Traffic Jam cannot be stopped unless reduced to 0 hit points. It moves up to its speed, trampling over objects and creatures in its path."},{"Name":"Legendary Resistance (3/Day)","Content":"If the Living Traffic Jam fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"The Living Traffic Jam makes two attacks with Tire Squeeze and one attack with Urban Crush."},{"Name":"Tire Squeeze","Content":"Melee Attack: +15 to hit, dealing 16 (2d10 + 5) bludgeoning damage. On a hit, the target must succeed on a DC 22 Strength saving throw or be grappled as it is caught within the crushing gears."},{"Name":"Urban Crush","Content":"Melee Attack: +15 to hit, dealing 31 (5d10 + 3) bludgeoning damage. The target must make a DC 22 Dexterity saving throw or suffer the Stunned condition until the end of its next turn, trapped in the scramble of vehicles."},{"Name":"Road Rage Surge","Content":"The Living Traffic Jam unleashes a wave of frustrated energy. Each creature in a 30-foot cone must make a DC 22 Wisdom saving throw or take 60 (11d10) psychic damage, representing the overwhelming stress and anger of the traffic nightmare, or half as much on a successful save."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Traffic Jam Surge (Costs 1 Action)","Content":"The Living Traffic Jam gains a burst of speed, allowing it to move up to half its speed in any direction without provoking opportunity attacks, merging with objects in its path and trapping them."},{"Name":"Panic Inducer (Costs 2 Actions)","Content":"The Living Traffic Jam targets one creature within 60 feet with a rush of chaotic energy. The target must make a DC 20 Intelligence saving throw. On a failure, they are frightened for 1 minute, feeling the overwhelming weight of the Jam’s presence. They can repeat the saving throw at the end of each of their turns, ending the effect on themselves on a success."},{"Name":"City-Wide Collapse (Costs 3 Actions)","Content":"The Living Traffic Jam creates a localized catastrophe in a 20-foot radius centered on itself. Each creature in that area must succeed on a DC 22 Strength saving throw or take 50 (9d10) bludgeoning damage and be knocked prone as the street buckles and crumbles under the pressure of the Jam's weight."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}