{"Source":"","Type":"Medium ooze, unaligned","HP":{"Value":37,"Notes":"5d10 + 10"},"AC":{"Value":14,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["20 ft., swim 40 ft."],"Abilities":{"Str":14,"Dex":12,"Con":15,"Int":1,"Wis":6,"Cha":1},"DamageVulnerabilities":[],"DamageResistances":["Acid, Bludgeoning, Slashing, and Piercing from non-magical weapons"],"DamageImmunities":["Poison"],"ConditionImmunities":["Blinded","Deafened","Frightened","Grappled","Prone","Restrained"],"Saves":[{"Name":"CON","Modifier":4},{"Name":"DEX","Modifier":3}],"Skills":[{"Name":"Stealth","Modifier":5}],"Senses":["Blindvision 60 ft."],"Languages":["—"],"Challenge":"1","Traits":[{"Name":"Moisture Absorption","Content":"The Plumbing Blob can absorb moisture from its surroundings, allowing it to heal 5 hit points at the start of its turn if it is in a damp environment."},{"Name":"Corrosive Surface","Content":"Any nonmagical surface that the Plumbing Blob moves over becomes slick and difficult to traverse. Creatures that move over this surface must succeed on a DC 12 Dexterity saving throw or fall prone."}],"Actions":[{"Name":"Slimy Slam","Content":"Melee Attack: +5 to hit, reaching out with a pseudopod of ooze to strike. On a hit, it deals 10 (2d6 + 3) bludgeoning damage. The target must succeed on a DC 12 Strength saving throw or be grappled by the blob, becoming unable to move until it escapes."},{"Name":"Corrosive Splash","Content":"Ranged Attack: +5 to hit, expelling a splash of corrosive slime at a range of 30 feet. On a hit, it deals 10 (2d6 + 3) acid damage. The target must succeed on a DC 12 Dexterity saving throw or have disadvantage on its next attack roll as the corrosive slime burns away at its weapon."},{"Name":"Engulf","Content":"The Plumbing Blob attempts to engulf a creature it is grappling. The target must make a DC 12 Dexterity saving throw. On a failure, the creature takes 15 (3d10) acid damage and is restrained. On a success, the creature takes half damage and escapes the grapple."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}