{"Source":"","Type":"Medium fiend (demon), chaotic evil","HP":{"Value":150,"Notes":"20d10 + 60"},"AC":{"Value":15,"Notes":"evasive reflexes"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["40 ft., climb 30 ft."],"Abilities":{"Str":16,"Dex":22,"Con":16,"Int":12,"Wis":14,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["Fire"],"DamageImmunities":[],"ConditionImmunities":[""],"Saves":[{"Name":"DEX","Modifier":10},{"Name":"CHA","Modifier":8}],"Skills":[{"Name":"Acrobatics","Modifier":10},{"Name":"Stealth","Modifier":10},{"Name":"Deception","Modifier":8}],"Senses":["Darkvision 60 ft."],"Languages":["Infernal, Common"],"Challenge":"9","Traits":[{"Name":"Evasive Maneuver","Content":"Springer, Jack can add his DEX modifier to his AC against one melee attack that he can see, provided he isn't incapacitated."},{"Name":"Fearsome Presence","Content":"Any creature that starts its turn within 30 feet of Springer, Jack must succeed on a DC 16 Wisdom saving throw or be frightened until the end of its next turn."}],"Actions":[{"Name":"Multiattack","Content":"Springer, Jack makes two Claw Swipe attacks."},{"Name":"Claw Swipe","Content":"Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 36 (7d8 + 5) slashing damage. The target must succeed on a DC 16 Strength saving throw or be knocked prone."},{"Name":"Blue Flame Burst (Recharge 5-6)","Content":"Springer, Jack exhales a 20-foot cone of blue flames. Each creature in that area must make a DC 15 Dexterity saving throw, taking 40 (9d8) fire damage on a failed save, or half as much damage on a successful one. Creatures that fail the save are also ignited, taking 5 (1d10) fire damage at the start of their turns for 1 minute. A creature can repeat the saving throw at the end of its turns to extinguish the flames."},{"Name":"Dread Leap","Content":"Springer, Jack vaults up to 30 feet into the air and lands on a target. Each creature within a 10-foot radius of the landing point must make a DC 16 Wisdom saving throw or be frightened until the end of their next turn. Additionally, the target of his landing takes 30 (6d8 + 3) bludgeoning damage, and if the target is frightened, the damage increases to 40 (8d8 + 3)."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}