{"Source":"","Type":"Small fey, neutral","HP":{"Value":93,"Notes":"11d10 + 33"},"AC":{"Value":16,"Notes":"Evasion and Magical Resistance"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["40 ft., climb 20 ft."],"Abilities":{"Str":10,"Dex":16,"Con":14,"Int":12,"Wis":15,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["Psychic, Thunder"],"DamageImmunities":["Poison"],"ConditionImmunities":["Charmed","Frightened"],"Saves":[{"Name":"DEX","Modifier":4},{"Name":"CHA","Modifier":5}],"Skills":[{"Name":"Acrobatics","Modifier":6},{"Name":"Persuasion","Modifier":7},{"Name":"Stealth","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Sylvan"],"Challenge":"4","Traits":[{"Name":"Springing Leap","Content":"El Sombreron can leap up to 20 feet in any direction, allowing it to evade threats and navigate obstacles with ease."},{"Name":"Hypnotic Presence","Content":"Creatures within 30 feet of El Sombreron that can see it must succeed on a DC 15 Wisdom saving throw or be charmed by it for 1 minute, becoming more susceptible to its enchantments."}],"Actions":[{"Name":"Multiattack","Content":"El Sombreron makes two Ensnaring Strikes. If it is engaged with another creature, it can also use its Dream Weaver once."},{"Name":"Ensnaring Strike","Content":"Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) psychic damage. The target must succeed on a DC 13 Wisdom saving throw or be charmed until the end of their next turn."},{"Name":"Dream Weaver","Content":"One creature charmed by El Sombreron must succeed on a DC 13 Constitution saving throw or fall into a deep sleep for 1 minute. While asleep, the target is incapacitated and cannot be awakened by non-magical means. The target can repeat the saving throw at the end of each of its turns, ending the sleep on a success."},{"Name":"Hypnotic Leap","Content":"El Sombreron makes a sudden leap forward, performing a mesmerizing dance. Each creature within 15 feet must succeed on a DC 15 Wisdom saving throw or be incapacitated until the start of their next turn. El Sombreron can use this ability once per short rest."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}