{"Source":"","Type":"Large monstrosity, unaligned","HP":{"Value":114,"Notes":"12d10 + 48"},"AC":{"Value":14,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["40 ft., climb 30 ft."],"Abilities":{"Str":18,"Dex":16,"Con":18,"Int":2,"Wis":12,"Cha":6},"DamageVulnerabilities":[],"DamageResistances":["Bludgeoning, Slashing and Piercing from non-magical weapons, Fire"],"DamageImmunities":["Poison"],"ConditionImmunities":["Poisoned"],"Saves":[{"Name":"STR","Modifier":7},{"Name":"DEX","Modifier":6},{"Name":"CON","Modifier":7}],"Skills":[{"Name":"Stealth","Modifier":6},{"Name":"Perception","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Understands Common but can't speak"],"Challenge":"6","Traits":[{"Name":"Ambush Predator","Content":"The Capelobo has advantage on attack rolls against creatures that have not taken a turn in the current combat."},{"Name":"Jungle Navigator","Content":"The Capelobo can traverse difficult terrain at normal speed in jungle environments and has advantage on Dexterity checks related to climbing and jumping."}],"Actions":[{"Name":"Multiattack","Content":"The Springer, Capelobo makes three attacks: one with Bite, one with Claw, and one with Charge. When its special ability is available, it can use the ability in place of Bite or Claw."},{"Name":"Bite","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) piercing damage. The target must succeed on a DC 15 Strength saving throw or be grappled. While grappled in this way, the target is also restrained until the grapple ends."},{"Name":"Claw","Content":"Melee Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (1d12 + 4) slashing damage. If the target is grappled, the Capelobo can drain some vitality, regaining hit points equal to the damage dealt."},{"Name":"Charge","Content":"Melee Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage, and the target must succeed on a DC 15 Strength saving throw or be pushed back 10 feet and knocked prone."},{"Name":"Blood Frenzy (Recharge 5-6)","Content":"The Capelobo enters a frenzied state, creating an effect in a 15-foot cone. Each creature in that area must make a DC 15 Dexterity saving throw, taking 31 (7d8) necrotic damage on a failed save, or half as much damage on a successful one. Additionally, if any creature is reduced to 0 hit points by this ability, the Capelobo regains hit points equal to half the damage dealt."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}