{"Source":"","Type":"Medium aberration, unaligned","HP":{"Value":75,"Notes":"10d8 + 30"},"AC":{"Value":14,"Notes":"Camouflage from Smoke"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft., jump 60 ft."],"Abilities":{"Str":12,"Dex":18,"Con":16,"Int":4,"Wis":10,"Cha":15},"DamageVulnerabilities":[],"DamageResistances":["Poison"],"DamageImmunities":[],"ConditionImmunities":[""],"Saves":[{"Name":"DEX","Modifier":6},{"Name":"CON","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":8},{"Name":"Deception","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Undercommon, Sylvan"],"Challenge":"4","Traits":[{"Name":"Acrid Camouflage","Content":"While in a cloud of its own poison smoke, Springer can use the Hide action as a bonus action, and attackers have disadvantage against it."},{"Name":"Chaotic Leap","Content":"When Springer jumps, it can choose to land in an unoccupied space up to its jump distance away, causing it to be hard to predict and making it harder to pinpoint."}],"Actions":[{"Name":"Multiattack","Content":"The Springer can make two attacks: one using its Noxious Breath and one using its Smoke Dash."},{"Name":"Noxious Breath","Content":"Ranged Attack: +6 to hit, dealing 16 (3d8 + 3) poison damage. The target must make a DC 14 Constitution saving throw, taking an additional poisoned condition until the end of their next turn on a failed save."},{"Name":"Smoke Dash","Content":"Instantaneously leap up to 60 feet, leaving behind a cloud of acrid smoke in a 10-foot radius. Each creature that starts its turn in the cloud must make a DC 14 Constitution saving throw. On a failed save, they take 14 (3d8 + 2) poison damage and are paralyzed until the end of their next turn."},{"Name":"Hallucinatory Plume","Content":"The Springer releases a surge of toxic gas in a 20-foot radius. All creatures within this area must succeed on a DC 14 Wisdom saving throw or suffer hallucinations, causing them to take 10 (3d6 + 1) psychic damage and become confused until the end of their next turn. This action recharges after a short or long rest."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}