{"Source":"","Type":"Medium undead, neutral","HP":{"Value":110,"Notes":"13d10 + 39"},"AC":{"Value":15,"Notes":"patchwork armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":12,"Dex":15,"Con":16,"Int":11,"Wis":18,"Cha":14},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic"],"DamageImmunities":["Poison"],"ConditionImmunities":["Poisoned"],"Saves":[{"Name":"WIS","Modifier":8},{"Name":"CHA","Modifier":6}],"Skills":[{"Name":"Perception","Modifier":8},{"Name":"Insight","Modifier":8}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Sylvan"],"Challenge":"6","Traits":[{"Name":"Harvest's Vigilance","Content":"The Kusa Sumashi can sense any disturbances to natural areas within 1 mile of its location. This awareness allows it to anticipate intruders and take actions to protect the land."},{"Name":"Spirit's Resilience","Content":"The Kusa Sumashi has advantage on saving throws against being grappled, restrained, or incapacitated due to its incorporeal nature."},{"Name":"Spellcasting","Content":"The Kusa Sumashi's spellcasting ability is Wisdom (spell save DC 16, +8 to hit with spell attacks). It can innately cast the following spells: At will: druidcraft, thorn whip, entangle. 1/day each: speak with plants, barkskin, summon animals."}],"Actions":[{"Name":"Multiattack","Content":"The Kusa Sumashi makes two attacks: one with Harvesting Scythe and one with Binding Grasp. Under certain circumstances, it can use Cursed Touch in place of one other attack."},{"Name":"Harvesting Scythe","Content":"Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) slashing damage. The target must succeed on a DC 15 Strength saving throw or be knocked prone as the Kusa Sumashi swings its scythe with unearthly force."},{"Name":"Binding Grasp","Content":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) necrotic damage. The target is grappled (escape DC 16) until the grapple ends, as the spectral essences of the land envelop them."},{"Name":"Cursed Touch","Content":"Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) necrotic damage. The target must make a DC 15 Constitution saving throw, taking 24 (7d6) necrotic damage on a failed save, or half as much damage on a successful one. On a failure, the target's movement speed is reduced by 10 feet until the end of its next turn."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}