{"Source":"","Type":"Large elemental, neutral","HP":{"Value":150,"Notes":"20d10 + 50"},"AC":{"Value":16,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":14,"Dex":14,"Con":17,"Int":12,"Wis":14,"Cha":11},"DamageVulnerabilities":[],"DamageResistances":["Cold, Fire, Force"],"DamageImmunities":["Poison, Psychic"],"ConditionImmunities":["Poisoned","Frightened"],"Saves":[{"Name":"CON","Modifier":8},{"Name":"WIS","Modifier":6},{"Name":"DEX","Modifier":6}],"Skills":[{"Name":"Nature","Modifier":6},{"Name":"Stealth","Modifier":6},{"Name":"Perception","Modifier":6}],"Senses":["Darkvision 60 ft."],"Languages":["Sylvan, understands Common but cannot speak"],"Challenge":"7","Traits":[{"Name":"Urban Haunter","Content":"The Ki Sumashi has advantage on Dexterity (Stealth) checks made in urban environments."},{"Name":"Vengeful Guardian","Content":"When the Ki Sumashi takes damage, it can use its reaction to gain temporary hit points equal to the damage taken (up to a maximum of 50 temporary hit points)."},{"Name":"Spellcasting","Content":"The Ki Sumashi's spellcasting ability is Wisdom (spell save DC 14, +6 to hit with spell attacks). It can innately cast the following spells, requiring no material components: At will: druidcraft, entangle, thorn whip; 3/day each: misty step, barkskin, hold person."}],"Actions":[{"Name":"Multiattack","Content":"The Ki Sumashi makes two attacks with Vine Strike."},{"Name":"Vine Strike","Content":"Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 4) slashing damage. The target must succeed on a DC 14 Strength saving throw or be grappled."},{"Name":"Nature's Wrath (Recharge 5-6)","Content":"The Ki Sumashi calls forth the fury of the natural world. All creatures within a 15 ft. radius must make a DC 16 Strength saving throw, taking 18 (4d6) bludgeoning damage on a failed save and be knocked prone, or half as much damage on a successful one."},{"Name":"Wrath of the Forest","Content":"The Ki Sumashi unleashes a wave of energy from its body as wood splinters and roots erupt from the ground. Each creature of its choice within a 20 ft. radius must make a DC 16 Dexterity saving throw, taking 30 (4d12 + 4) piercing damage on a failed save and becoming immobilized until the end of its next turn, or half as much damage on a successful one. This ability can be used once, and then requires completion of a short or long rest to reuse."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}