{"Source":"","Type":"Medium elemental, neutral","HP":{"Value":165,"Notes":"20d10 + 65"},"AC":{"Value":16,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft., swim 60 ft."],"Abilities":{"Str":14,"Dex":18,"Con":16,"Int":11,"Wis":15,"Cha":14},"DamageVulnerabilities":[],"DamageResistances":["Cold, Fire, Psychic"],"DamageImmunities":["Poison, Bludgeoning, Slashing and Piercing from non-magical weapons"],"ConditionImmunities":["Poisoned","Frightened"],"Saves":[{"Name":"DEX","Modifier":9},{"Name":"CON","Modifier":6},{"Name":"WIS","Modifier":5}],"Skills":[{"Name":"Perception","Modifier":5},{"Name":"Stealth","Modifier":9}],"Senses":["Darkvision 60 ft."],"Languages":["Aquan, Primordial"],"Challenge":"8","Traits":[{"Name":"Fluid Form","Content":"The Mizu Sumashi can move through a space as narrow as 1 inch wide without squeezing. It can also meld into water or mist, allowing it to become invisible in such environments."},{"Name":"Guardian of Waters","Content":"All creatures within a 30-foot radius of the Mizu Sumashi are blessed, gaining advantage on saving throws against being poisoned or frightened."},{"Name":"Spellcasting","Content":"The Mizu Sumashi’s spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). It can innately cast the following spells, requiring no material components: At will: shape water, create water. 3/day each: fog cloud, hold person, summon water elemental."}],"Actions":[{"Name":"Multiattack","Content":"The Mizu Sumashi makes two attacks with Tail Whip."},{"Name":"Tail Whip","Content":"Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 6) damage (bludgeoning). If the target is a creature, it must succeed on a DC 14 Constitution saving throw or be knocked prone as water surges around its legs."},{"Name":"Riptide Surge (Recharge 5-6)","Content":"The Mizu Sumashi creates a swirling current in a 20-foot radius centered on itself. Each creature in that area must make a DC 14 Strength saving throw, taking 42 (10d8) damage (force) on a failed save, or half as much damage on a successful one. On a failed save, the creatures are also pulled 10 feet closer to the Mizu Sumashi, as if caught in a powerful undertow."},{"Name":"Misty Veil","Content":"The Mizu Sumashi envelops itself in a thick mist, becoming difficult to target. For the next turn, it gains advantage on all saving throws and ranged attack rolls against it are made at disadvantage. Additionally, any creature that starts its turn within 10 feet of the Mizu Sumashi must succeed on a DC 14 Wisdom saving throw or be blinded until the end of its next turn."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}