{"Source":"","Type":"Medium undead, neutral","HP":{"Value":165,"Notes":"20d10 + 65"},"AC":{"Value":16,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":15,"Con":20,"Int":13,"Wis":16,"Cha":12},"DamageVulnerabilities":[],"DamageResistances":["Cold, Lightning, Necrotic"],"DamageImmunities":["Poison, Psychic"],"ConditionImmunities":["Frightened","Poisoned"],"Saves":[{"Name":"CON","Modifier":7},{"Name":"WIS","Modifier":5},{"Name":"CHA","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":5},{"Name":"Insight","Modifier":5},{"Name":"Intimidation","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Common, understands Primordial but cannot speak"],"Challenge":"8","Traits":[{"Name":"Fearful Presence","Content":"Creatures within 30 feet of the Abura Sumashi must succeed on a DC 15 Wisdom saving throw at the start of their turn or be frightened until the end of their next turn."},{"Name":"Supernatural Malice","Content":"As a reaction, when the Abura Sumashi is insulted or disrespected, it can inflict a curse on the offender. The enemy must make a DC 15 Charisma saving throw or suffer disadvantage on all rolls until the curse is lifted by a restoration spell or similar magic."},{"Name":"Spellcasting","Content":"The Abura Sumashi is a 10th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 15, +7 to hit with spell attacks). It has the following spells prepared: At will: minor illusion, disguise self; 3/day each: fear, silence, darkness; 1/day each: bestow curse, shadow of moil."}],"Actions":[{"Name":"Multiattack","Content":"The Abura Sumashi makes two Attacks with Stone Grasp."},{"Name":"Stone Grasp","Content":"Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 6) damage. Additionally, the target must succeed on a DC 15 Strength saving throw or be restrained by the Abura Sumashi's stone-like grasp until the end of its next turn."},{"Name":"Whispers of Dread (Recharge 5-6)","Content":"The Abura Sumashi manifests its unsettling presence in a 30-foot radius centered on itself. Each creature in that area must make a DC 14 Wisdom saving throw, taking 42 (10d8) psychic damage on a failed save, or half as much damage on a successful one. On a failed save, creatures are also frightened until the end of their next turn."},{"Name":"Haunting Appearance","Content":"As a reaction to being insulted, the Abura Sumashi can become incorporeal, gaining resistance to all damage until the start of its next turn. It can then choose to vanish and reappear up to 30 feet away in a space it can see."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}