{"Source":"","Type":"Medium Undead, neutral","HP":{"Value":135,"Notes":"18d10 + 45"},"AC":{"Value":16,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft., fly 60 ft. (hover)"],"Abilities":{"Str":10,"Dex":16,"Con":16,"Int":12,"Wis":14,"Cha":18},"DamageVulnerabilities":[],"DamageResistances":["Fire, Psychic"],"DamageImmunities":["Poison"],"ConditionImmunities":["Paralyzed","Poisoned"],"Saves":[{"Name":"DEX","Modifier":6},{"Name":"CON","Modifier":6},{"Name":"WIS","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":9},{"Name":"Religion","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Primordial, speaks through smoke and flame (telepathy within 60 ft.)"],"Challenge":"8","Traits":[{"Name":"Drifting Guardian","Content":"The Kemuri Sumashi can move through cracks and walls as if they were difficult terrain. It can pass through objects and creatures; if it does, it can choose to become incorporeal and ignore their space."},{"Name":"Spirit of Smoke","Content":"The creature can manipulate air and heat, allowing it to create small illusions or produce minor sensory effects, such as flickering lights in smoke or whispers in the air."},{"Name":"Spellcasting","Content":"The Kemuri Sumashi is a 10th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 16, +8 to hit with spell attacks). It has the following spells prepared: Cantrips (at will): minor illusion, thaumaturgy, dancing lights. Spells (2nd level or lower): 4 slots: misty step, invisibility, scorching ray, fireball."}],"Actions":[{"Name":"Multiattack","Content":"The Kemuri Sumashi makes two attacks with Scorching Touch."},{"Name":"Scorching Touch","Content":"Melee Spell Attack: +8 to hit, reach 5 ft., one target. Hit: 18 (3d6 + 6) fire damage. The target must succeed on a DC 16 Constitution saving throw or have disadvantage on attack rolls until the end of its next turn."},{"Name":"Incendiary Burst (Recharge 5-6)","Content":"The creature creates an aura of searing flames in a 20-foot radius centered on itself. Each creature in that area must make a DC 16 Dexterity saving throw, taking 60 (10d10) fire damage on a failed save, or half as much damage on a successful one. Additionally, affected creatures are set ablaze, taking an extra 10 (3d6) fire damage at the start of their turns until they or another creature takes an action to extinguish the flames."},{"Name":"Ghostly Veil","Content":"The Kemuri Sumashi envelops itself and nearby creatures in a cloud of thick smoke. Each creature of its choice within a 15-foot radius must make a DC 16 Wisdom saving throw or become blinded until the end of its next turn. Creatures within the smoke have advantage on Dexterity (Stealth) checks made to hide while it lasts."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}