{"Source":"","Type":"Huge aberration, unaligned","HP":{"Value":325,"Notes":"27d12 + 150"},"AC":{"Value":18,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft."],"Abilities":{"Str":10,"Dex":16,"Con":20,"Int":18,"Wis":12,"Cha":10},"DamageVulnerabilities":[],"DamageResistances":["Cold, Fire, Psychic, Thunder"],"DamageImmunities":["Poison, Bludgeoning, Slashing and Piercing from non-magical weapons"],"ConditionImmunities":["Frightened","Incapacitated"],"Saves":[{"Name":"CON","Modifier":12},{"Name":"INT","Modifier":9},{"Name":"WIS","Modifier":9},{"Name":"DEX","Modifier":8}],"Skills":[{"Name":"Insight","Modifier":9},{"Name":"Perception","Modifier":9},{"Name":"Stealth","Modifier":8}],"Senses":["Blindsight 60 ft."],"Languages":["Undercommon, Deep Speech"],"Challenge":"15","Traits":[{"Name":"Resonant Aura","Content":"The presence of Taos Hum creates an aura of unease, causing creatures within 30 feet to have disadvantage on saving throws against being frightened."},{"Name":"Whispers of the Past","Content":"Creatures that can hear Taos Hum must succeed on a DC 17 Wisdom saving throw or suffer disadvantage on Wisdom saving throws until the end of their next turn."},{"Name":"Legendary Resistance (3/Day)","Content":"If the creature fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"The presence of Taos Hum creates a disconcerting aura that affects the minds of its targets. It can unleash a resonating vibration twice as a psychic attack and follow with a disorienting pulse."},{"Name":"Dissonant Strike","Content":"Melee Attack: +8 to hit, dealing 9 (1d10 + 3) psychic damage. Affected targets must succeed on a DC 17 Intelligence saving throw or be stunned until the end of their next turn."},{"Name":"Resonating Pulse","Content":"Melee Attack: +8 to hit, dealing 9 (1d10 + 3) thunder damage. On a failed DC 18 Constitution saving throw, the target is pushed back 10 feet and cannot take reactions until the end of its next turn."},{"Name":"Void Resonance","Content":"Each creature within a 30-foot radius must make a DC 16 Wisdom saving throw or take 33 (7d10) psychic damage, or half as much on a successful save. Creatures that fail the save also suffer disadvantage on the next attack roll they make before the end of their next turn."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Echoing Veil (Costs 1 Action)","Content":"Taos Hum envelops itself in a shroud of discordant sound, creating an illusory distortion of its true form. For the next round, it imposes disadvantage on attack rolls against it."},{"Name":"Harmonic Displacement (Costs 2 Actions)","Content":"The creature can choose to use Void Resonance."},{"Name":"Uproarious Wail (Costs 3 Actions)","Content":"Taos Hum emits a terrifying wail that resonates with deeply buried fears. Each creature of its choice within 60 feet must make a DC 18 Wisdom saving throw, taking 27 (5d10) psychic damage on a failed save or half as much on a success. Those who fail are also frightened until the end of their next turn."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}