{"Source":"","Type":"Medium humanoid (human), chaotic neutral","HP":{"Value":104,"Notes":"11d10 + 44"},"AC":{"Value":17,"Notes":"blessed jacket"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft."],"Abilities":{"Str":10,"Dex":16,"Con":18,"Int":12,"Wis":14,"Cha":14},"DamageVulnerabilities":[],"DamageResistances":["Psychic, Thunder, Force"],"DamageImmunities":["Bludgeoning, Slashing and Piercing from non-magical weapons"],"ConditionImmunities":["Frightened","Charmed"],"Saves":[{"Name":"DEX","Modifier":5},{"Name":"CON","Modifier":4},{"Name":"WIS","Modifier":2}],"Skills":[{"Name":"Stealth","Modifier":8},{"Name":"Arcana","Modifier":3},{"Name":"History","Modifier":5}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Elvish, Thieves' Cant"],"Challenge":"6","Traits":[{"Name":"Probability Manipulation","Content":"The Time Traveling Hipster has a knack for staying unnoticed, granting them advantage on Dexterity (Stealth) checks. Additionally, they can reroll one failed saving throw per long rest."},{"Name":"Evasive Maneuvers","Content":"The Time Traveling Hipster can use their reaction to impose disadvantage on attack rolls against them if they can see the attacker."},{"Name":"Spellcasting","Content":"The Time Traveling Hipster is a 6th-level spellcaster. Their spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). They can innately cast the following spells: At will: minor illusion, dancing lights. 1/day each: dimension door, invisibility, mirror image."}],"Actions":[{"Name":"Multiattack","Content":"The Time Traveling Hipster makes two attacks: one with Temporal Displacement and one with Probability Burst."},{"Name":"Temporal Displacement","Content":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) psychic damage. The target must succeed on a DC 14 Wisdom saving throw or be unable to take reactions until the start of the Time Traveling Hipster's next turn."},{"Name":"Probability Burst","Content":"Ranged Spell Attack: +6 to hit, range 60 ft., one target. Hit: 14 (2d10 + 3) force damage. The target must succeed on a DC 14 Constitution saving throw or be pushed back 10 feet and knocked prone."},{"Name":"Temporal Distortion (Recharge 6)","Content":"A 15-foot-radius effect extends out from the Time Traveling Hipster. Each creature in that area must succeed on a DC 14 Dexterity saving throw or become disoriented. While affected, a target takes 5 (1d10) thunder damage at the start of each of its turns. A target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."},{"Name":"Retroactive Humor (1/Day)","Content":"The Time Traveling Hipster performs a quirky movement, causing laughter. Each creature within 20 feet of it must succeed on a DC 14 Constitution saving throw or become incapacitated until the end of the Time Traveling Hipster's next turn as they are overwhelmed by confusion."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}