{"Source":"","Type":"Medium undead, neutral","HP":{"Value":75,"Notes":"10d10 + 20"},"AC":{"Value":14,"Notes":"natural armor"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["50 ft."],"Abilities":{"Str":10,"Dex":18,"Con":14,"Int":12,"Wis":14,"Cha":16},"DamageVulnerabilities":[],"DamageResistances":["Necrotic"],"DamageImmunities":["None"],"ConditionImmunities":["Frightened","Incapacitated"],"Saves":[{"Name":"DEX","Modifier":7},{"Name":"WIS","Modifier":5}],"Skills":[{"Name":"Stealth","Modifier":7},{"Name":"Investigation","Modifier":4}],"Senses":["Darkvision 60 ft."],"Languages":["Common, Understands all languages it knew in life but cannot speak"],"Challenge":"6","Traits":[{"Name":"Evasive Flicker","Content":"The Urban Wraith's ghostly silhouette makes it difficult to pin down. It has advantage on Dexterity saving throws and is treated as having three-quarters cover against ranged attacks."},{"Name":"Surveillance Loop","Content":"The Urban Wraith can remain hidden even in plain sight, often making it appear as if it is stuck in a repetitive loop. Invisible to non-magical detect effects, it can stealthily observe without being detected."}],"Actions":[{"Name":"Multiattack","Content":"The Urban Wraith makes four attacks: one with Ethereal Touch and three with Frightening Grasp."},{"Name":"Ethereal Touch","Content":"Melee Spell Attack: +8 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) necrotic damage. The target must make a DC 15 Wisdom saving throw or be frightened until the end of its next turn as it feels the chilling grasp of the afterlife."},{"Name":"Frightening Grasp","Content":"Melee Spell Attack: +8 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) necrotic damage. The target must make a DC 15 Constitution saving throw or take an additional 5 (1d10) necrotic damage as the wraith corrupts their essence."},{"Name":"Temporal Disruption","Content":"The Urban Wraith flickers in and out of reality, creating an abrupt time warp. Each creature within a 15-foot radius must make a DC 15 Dexterity saving throw. On a failed save, a creature takes 30 (4d12 + 4) psychic damage and is incapacitated until the end of its next turn. On a success, they take half damage and are not incapacitated. This action can be used once per short rest."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}