{"Source":"","Type":"Gargantuan aberration, neutral evil","HP":{"Value":285,"Notes":"27d12 + 110"},"AC":{"Value":16,"Notes":"magical aura"},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["30 ft., fly 60 ft."],"Abilities":{"Str":30,"Dex":12,"Con":20,"Int":18,"Wis":15,"Cha":22},"DamageVulnerabilities":[],"DamageResistances":["Necrotic, Psychic"],"DamageImmunities":["None"],"ConditionImmunities":["Charmed","Frightened","Paralyzed"],"Saves":[{"Name":"STR","Modifier":11},{"Name":"CON","Modifier":11},{"Name":"INT","Modifier":10},{"Name":"CHA","Modifier":12}],"Skills":[{"Name":"Arcana","Modifier":10},{"Name":"Insight","Modifier":9},{"Name":"Persuasion","Modifier":12}],"Senses":["Truesight 120 ft.","darkvision 120 ft."],"Languages":["All, telepathy 120 ft."],"Challenge":"20","Traits":[{"Name":"Life Drain Aura","Content":"Any creature that starts its turn within 30 feet of C'thithr'zho takes 10 (3d6) necrotic damage."},{"Name":"Conduit of Despair","Content":"When C'thithr'zho takes damage, it can choose to regain hit points equal to half the damage taken."},{"Name":"Spellcasting","Content":"C'thithr'zho's spellcasting ability is Charisma (spell save DC 20, +12 to hit with spell attacks). It can innately cast the following spells: At will: eldritch blast, minor illusion. 3/day each: hunger of Hadar, fear, dominate person. 1/day each: power word stun, psychic scream."},{"Name":"Legendary Resistance (3/Day)","Content":"If C'thithr'zho fails a saving throw, it can choose to succeed instead."}],"Actions":[{"Name":"Multiattack","Content":"C'thithr'zho makes two attacks with Devour Life and one attack with Eviscerate."},{"Name":"Devour Life","Content":"Melee Attack: +16 to hit, dealing 17 (2d10 + 6) necrotic damage. If the target is reduced to 0 hit points, C'thithr'zho regains hit points equal to the damage dealt."},{"Name":"Eviscerate","Content":"Melee Attack: +16 to hit, dealing 45 (7d10 + 6) slashing damage. The creature must make a DC 23 Constitution saving throw or be paralyzed until the end of its next turn."},{"Name":"Desolation's Embrace","Content":"C'thithr'zho unleashes a wave of despair in a 60-foot radius. Each creature within range must make a DC 23 Wisdom saving throw or take 60 (11d10) psychic damage and be frightened until the end of their next turn on a failed save, or half as much damage on a successful one."}],"BonusActions":[],"Reactions":[],"LegendaryActions":[{"Name":"Siphon Spirit (Costs 1 Action)","Content":"C'thithr'zho targets one creature within 60 feet and attempts to siphon their life force. The creature must succeed on a DC 23 Constitution saving throw or take 20 (4d8 + 6) necrotic damage, and C'thithr'zho regains hit points equal to half the damage dealt. On a successful save, the target takes half as much damage and C'thithr'zho regains no hit points."},{"Name":"Wail of the Damned (Costs 2 Actions)","Content":"C'thithr'zho issues a haunting cry that targets one creature. The creature must make a DC 23 Wisdom saving throw. On a failed save, the target becomes incapacitated until the end of its next turn as the sound of lament fills their mind with despair."},{"Name":"Shadow of Oblivion (Costs 3 Actions)","Content":"C'thithr'zho manifests a dark shadow that spreads within a 30-foot radius around itself. Each creature within range must make a DC 23 Dexterity saving throw. On a failed save, they take 50 (9d10) necrotic damage and are blinded until the end of their next turn. On a successful save, they take half as much damage and are not blinded."}],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}