{"Source":"","Type":"Medium undead, neutral","HP":{"Value":150,"Notes":"20d10 + 60"},"AC":{"Value":15,"Notes":""},"InitiativeModifier":0,"InitiativeAdvantage":false,"Speed":["0 ft., fly 60 ft. (hover)"],"Abilities":{"Str":1,"Dex":18,"Con":16,"Int":3,"Wis":12,"Cha":20},"DamageVulnerabilities":[],"DamageResistances":["Bludgeoning, Slashing and Piercing from non-magical weapons"],"DamageImmunities":[],"ConditionImmunities":["Incapacitated","Frightened"],"Saves":[{"Name":"DEX","Modifier":8},{"Name":"CHA","Modifier":9}],"Skills":[{"Name":"Stealth","Modifier":12},{"Name":"Perception","Modifier":5}],"Senses":["Blindsight 60 ft."],"Languages":["Understands all languages it knew in life but can't speak"],"Challenge":"9","Traits":[{"Name":"Evasive Presence","Content":"Window Knockers can use their spectral nature to avoid detection, granting them advantage on Stealth checks and making them immune to Opportunity Attacks."},{"Name":"Haunting Code","Content":"When a tool or a window is knocked upon by a Window Knocker, the sound resonates in a manner that can be perceived by living beings up to 120 ft. away, instilling unease and vigilance."}],"Actions":[{"Name":"Multiattack","Content":"The Window Knockers make two Knocking Slaps and one Haunting Raps."},{"Name":"Knocking Slap","Content":"Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 18 (4d6 + 4) damage. This attack deals psychic damage as the echoes of the raps invade the target's mind, causing disorientation."},{"Name":"Haunting Raps","Content":"Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 16 (2d8 + 6) damage. If the target is a creature, it must succeed on a DC 15 Wisdom saving throw or be frightened until the end of its next turn, haunted by the rhythmic echoes of the knocks."},{"Name":"Cacophony of Knocks (Recharge 5-6)","Content":"The Window Knockers create a chilling echo in a 15-foot cone. Each creature within that area must make a DC 15 Dexterity saving throw, taking 40 (9d8) psychic damage on a failed save, or half as much damage on a successful one. The sound resounds like a multitude of knocks, causing unease and paranoia."}],"BonusActions":[],"Reactions":[],"MythicActions":[],"Description":"","Player":"","Version":"3.6.10","ImageURL":""}